tiborsimon/embedded-tdd-headers/pic/8bit/pic16f18877_tdd.h
/* Generated on 2016-07-26
===============================================================================
      P I C   T D D   R E A D Y   R E G I S T E R   D E F I N I T I O N
===============================================================================

Created by Tibor Simon - tiborsimon.io
Generator script:  https://github.com/tiborsimon/pic-definition-converter

Based on the register definition header file v1.37 provided by Microchip.
Original definition date and license: */

// Generated 11/03/2016 GMT

/*
* Copyright © 2016, Microchip Technology Inc. and its subsidiaries ("Microchip")
* All rights reserved.
*
* This software is developed by Microchip Technology Inc. and its subsidiaries ("Microchip").
*
* Redistribution and use in source and binary forms, with or without modification, are
* permitted provided that the following conditions are met:
*
*     1. Redistributions of source code must retain the above copyright notice, this list of
*        conditions and the following disclaimer.
*
*     2. Redistributions in binary form must reproduce the above copyright notice, this list
*        of conditions and the following disclaimer in the documentation and/or other
*        materials provided with the distribution.
*
*     3. Microchip's name may not be used to endorse or promote products derived from this
*        software without specific prior written permission.
*
* THIS SOFTWARE IS PROVIDED BY MICROCHIP "AS IS" AND ANY EXPRESS OR IMPLIED WARRANTIES,
* INCLUDING, BUT NOT LIMITED TO, THE IMPLIED WARRANTIES OF MERCHANTABILITY AND FITNESS FOR
* PURPOSE ARE DISCLAIMED.  IN NO EVENT SHALL MICROCHIP BE LIABLE FOR ANY DIRECT, INDIRECT,
* INCIDENTAL, SPECIAL, EXEMPLARY, OR CONSEQUENTIAL DAMAGES (INCLUDING BUT NOT LIMITED TO
* PROCUREMENT OF SUBSTITUTE GOODS OR SERVICES; LOSS OF USE, DATA OR PROFITS; OR BUSINESS
* INTERRUPTION) HOWSOEVER CAUSED AND ON ANY THEORY OF LIABILITY, WHETHER IN CONTRACT, STRICT
* LIABILITY, OR TORT (INCLUDING NEGLIGENCE OR OTHERWISE) ARISING IN ANY WAY OUT OF THE USE OF
* THIS SOFTWARE, EVEN IF ADVISED OF THE POSSIBILITY OF SUCH DAMAGE.
*  */

#ifndef _PIC16F18877_H_
#define _PIC16F18877_H_

#define INDF0                         0
#define INDF1                         1
#define PCL                           2
#define STATUS                        3
#define C                             4
#define CARRY                         5
#define STATUS_DC                     6
#define ZERO                          7
#define Z                             8
#define nPD                           9
#define nTO                           10
#define FSR0L                         11
#define FSR0H                         12
#define FSR1L                         13
#define FSR1H                         14
#define BSR                           15
#define BSR0                          16
#define BSR1                          17
#define BSR2                          18
#define BSR3                          19
#define BSR4                          20
#define BSR5                          21
#define WREG                          22
#define WREG0                         23
#define PCLATH                        24
#define INTCON                        25
#define INTEDG                        26
#define PEIE                          27
#define GIE                           28
#define PORTA                         29
#define RA0                           30
#define RA1                           31
#define RA2                           32
#define RA3                           33
#define RA4                           34
#define RA5                           35
#define RA6                           36
#define RA7                           37
#define PORTB                         38
#define RB0                           39
#define RB1                           40
#define RB2                           41
#define RB3                           42
#define RB4                           43
#define RB5                           44
#define RB6                           45
#define RB7                           46
#define PORTC                         47
#define RC0                           48
#define RC1                           49
#define RC2                           50
#define RC3                           51
#define RC4                           52
#define RC5                           53
#define RC6                           54
#define RC7                           55
#define PORTD                         56
#define RD0                           57
#define RD1                           58
#define RD2                           59
#define RD3                           60
#define RD4                           61
#define RD5                           62
#define RD6                           63
#define RD7                           64
#define PORTE                         65
#define RE0                           66
#define RE1                           67
#define RE2                           68
#define RE3                           69
#define TRISA                         70
#define TRISA0                        71
#define TRISA1                        72
#define TRISA2                        73
#define TRISA3                        74
#define TRISA4                        75
#define TRISA5                        76
#define TRISA6                        77
#define TRISA7                        78
#define TRISB                         79
#define TRISB0                        80
#define TRISB1                        81
#define TRISB2                        82
#define TRISB3                        83
#define TRISB4                        84
#define TRISB5                        85
#define TRISB6                        86
#define TRISB7                        87
#define TRISC                         88
#define TRISC0                        89
#define TRISC1                        90
#define TRISC2                        91
#define TRISC3                        92
#define TRISC4                        93
#define TRISC5                        94
#define TRISC6                        95
#define TRISC7                        96
#define TRISD                         97
#define TRISD0                        98
#define TRISD1                        99
#define TRISD2                        100
#define TRISD3                        101
#define TRISD4                        102
#define TRISD5                        103
#define TRISD6                        104
#define TRISD7                        105
#define TRISE                         106
#define TRISE0                        107
#define TRISE1                        108
#define TRISE2                        109
#define LATA                          110
#define LATA0                         111
#define LATA1                         112
#define LATA2                         113
#define LATA3                         114
#define LATA4                         115
#define LATA5                         116
#define LATA6                         117
#define LATA7                         118
#define LATB                          119
#define LATB0                         120
#define LATB1                         121
#define LATB2                         122
#define LATB3                         123
#define LATB4                         124
#define LATB5                         125
#define LATB6                         126
#define LATB7                         127
#define LATC                          128
#define LATC0                         129
#define LATC1                         130
#define LATC2                         131
#define LATC3                         132
#define LATC4                         133
#define LATC5                         134
#define LATC6                         135
#define LATC7                         136
#define LATD                          137
#define LATD0                         138
#define LATD1                         139
#define LATD2                         140
#define LATD3                         141
#define LATD4                         142
#define LATD5                         143
#define LATD6                         144
#define LATD7                         145
#define LATE                          146
#define LATE0                         147
#define LATE1                         148
#define LATE2                         149
#define TMR0L0                        150
#define TMR0L                         151
#define TMR0L1                        152
#define TMR0L2                        153
#define TMR0L3                        154
#define TMR0L4                        155
#define TMR0L5                        156
#define TMR0L6                        157
#define TMR0L7                        158
#define TMR0H0                        159
#define T0PR                          160
#define TMR0H                         161
#define T0PR0                         162
#define TMR0H1                        163
#define T0PR1                         164
#define TMR0H2                        165
#define T0PR2                         166
#define TMR0H3                        167
#define T0PR3                         168
#define TMR0H4                        169
#define T0PR4                         170
#define TMR0H5                        171
#define T0PR5                         172
#define TMR0H6                        173
#define T0PR6                         174
#define TMR0H7                        175
#define T0PR7                         176
#define T0CON0                        177
#define T0OUTPS                       178
#define T0OUTPS0                      179
#define T0OUTPS1                      180
#define T0OUTPS2                      181
#define T0OUTPS3                      182
#define T016BIT                       183
#define T0OUT                         184
#define T0EN                          185
#define T0CON1                        186
#define T0PS                          187
#define T0CKPS                        188
#define T0CKPS0                       189
#define T0PS0                         190
#define T0CKPS1                       191
#define T0PS1                         192
#define T0CKPS2                       193
#define T0PS2                         194
#define T0CKPS3                       195
#define T0PS3                         196
#define T0ASYNC                       197
#define T0CS                          198
#define T0CS0                         199
#define T0CS1                         200
#define T0CS2                         201
#define ADRESL                        202
#define ADPREVL                       203
#define ADPREV0                       204
#define ADPREV1                       205
#define ADPREV2                       206
#define ADPREV3                       207
#define ADPREV4                       208
#define ADPREV5                       209
#define ADPREV6                       210
#define ADPREV7                       211
#define ADPREVH                       212
#define ADPREV8                       213
#define ADPREV9                       214
#define ADPREV10                      215
#define ADPREV11                      216
#define ADPREV12                      217
#define ADPREV13                      218
#define ADPREV14                      219
#define ADPREV15                      220
#define ADACC0                        221
#define ADACCL                        222
#define ADACC1                        223
#define ADACC2                        224
#define ADACC3                        225
#define ADACC4                        226
#define ADACC5                        227
#define ADACC6                        228
#define ADACC7                        229
#define ADACC8                        230
#define ADACCH                        231
#define ADACC9                        232
#define ADACC10                       233
#define ADACC11                       234
#define ADACC12                       235
#define ADACC13                       236
#define ADACC14                       237
#define ADACC15                       238
#define ADCON0                        239
#define nDONE                         240
#define DONE                          241
#define GO                            242
#define GO_nDONE                      243
#define ADGO                          244
#define ADFM                          245
#define ADFM0                         246
#define ADFM1                         247
#define ADCS                          248
#define ADCONT                        249
#define ADON                          250
#define ADCON1                        251
#define ADDSEN                        252
#define ADGPOL                        253
#define ADIPEN                        254
#define ADPPOL                        255
#define ADCON2                        256
#define ADMD                          257
#define ADMD0                         258
#define ADMD1                         259
#define ADMD2                         260
#define ADACLR                        261
#define ADCRS                         262
#define ADCRS0                        263
#define ADCRS1                        264
#define ADCRS2                        265
#define ADPSIS                        266
#define ADCON3                        267
#define ADTMD                         268
#define ADTMD0                        269
#define ADTMD1                        270
#define ADTMD2                        271
#define ADSOI                         272
#define ADCALC                        273
#define ADCALC0                       274
#define ADCALC1                       275
#define ADCALC2                       276
#define ADSTAT                        277
#define ADSTAT0                       278
#define ADSTAT1                       279
#define ADSTAT2                       280
#define ADMACT                        281
#define ADMATH                        282
#define ADLTHR                        283
#define ADUTHR                        284
#define ADAOV                         285
#define ADCLK                         286
#define ADCCS0                        287
#define ADCCS                         288
#define ADCCS1                        289
#define ADCCS2                        290
#define ADCCS3                        291
#define ADCCS4                        292
#define ADCCS5                        293
#define ADACT0                        294
#define ADACT                         295
#define ADACT1                        296
#define ADACT2                        297
#define ADACT3                        298
#define ADACT4                        299
#define ADREF                         300
#define ADPREF                        301
#define ADPREF0                       302
#define ADPREF1                       303
#define ADNREF                        304
#define ADCAP                         305
#define ADCAP0                        306
#define ADCAP1                        307
#define ADCAP2                        308
#define ADCAP3                        309
#define ADCAP4                        310
#define ADPRE0                        311
#define ADPRE                         312
#define ADPRE1                        313
#define ADPRE2                        314
#define ADPRE3                        315
#define ADPRE4                        316
#define ADPRE5                        317
#define ADPRE6                        318
#define ADPRE7                        319
#define ADACQ                         320
#define ADACQ0                        321
#define ADACQ1                        322
#define ADACQ2                        323
#define ADACQ3                        324
#define ADACQ4                        325
#define ADACQ5                        326
#define ADACQ6                        327
#define ADACQ7                        328
#define ADPCH                         329
#define ADPCH0                        330
#define ADPCH1                        331
#define ADPCH2                        332
#define ADPCH3                        333
#define ADPCH4                        334
#define ADPCH5                        335
#define ADCNT0                        336
#define ADCNT                         337
#define ADCNT1                        338
#define ADCNT2                        339
#define ADCNT3                        340
#define ADCNT4                        341
#define ADCNT5                        342
#define ADCNT6                        343
#define ADCNT7                        344
#define ADRPT0                        345
#define ADRPT                         346
#define ADRPT1                        347
#define ADRPT2                        348
#define ADRPT3                        349
#define ADRPT4                        350
#define ADRPT5                        351
#define ADRPT6                        352
#define ADRPT7                        353
#define ADLTH0                        354
#define ADLTHL                        355
#define ADLTH1                        356
#define ADLTH2                        357
#define ADLTH3                        358
#define ADLTH4                        359
#define ADLTH5                        360
#define ADLTH6                        361
#define ADLTH7                        362
#define ADLTH8                        363
#define ADLTHH                        364
#define ADLTH9                        365
#define ADLTH10                       366
#define ADLTH11                       367
#define ADLTH12                       368
#define ADLTH13                       369
#define ADLTH14                       370
#define ADLTH15                       371
#define ADUTH0                        372
#define ADUTHL                        373
#define ADUTH1                        374
#define ADUTH2                        375
#define ADUTH3                        376
#define ADUTH4                        377
#define ADUTH5                        378
#define ADUTH6                        379
#define ADUTH7                        380
#define ADUTH8                        381
#define ADUTHH                        382
#define ADUTH9                        383
#define ADUTH10                       384
#define ADUTH11                       385
#define ADUTH12                       386
#define ADUTH13                       387
#define ADUTH14                       388
#define ADUTH15                       389
#define ADSTPT0                       390
#define ADSTPTL                       391
#define ADSTPT1                       392
#define ADSTPT2                       393
#define ADSTPT3                       394
#define ADSTPT4                       395
#define ADSTPT5                       396
#define ADSTPT6                       397
#define ADSTPT7                       398
#define ADSTPT8                       399
#define ADSTPTH                       400
#define ADSTPT9                       401
#define ADSTPT10                      402
#define ADSTPT11                      403
#define ADSTPT12                      404
#define ADSTPT13                      405
#define ADSTPT14                      406
#define ADSTPT15                      407
#define ADFLTR0                       408
#define ADFLTRL                       409
#define ADFLTR1                       410
#define ADFLTR2                       411
#define ADFLTR3                       412
#define ADFLTR4                       413
#define ADFLTR5                       414
#define ADFLTR6                       415
#define ADFLTR7                       416
#define ADFLTR8                       417
#define ADFLTRH                       418
#define ADFLTR9                       419
#define ADFLTR10                      420
#define ADFLTR11                      421
#define ADFLTR12                      422
#define ADFLTR13                      423
#define ADFLTR14                      424
#define ADFLTR15                      425
#define ADERR0                        426
#define ADERRL                        427
#define ADERR1                        428
#define ADERR2                        429
#define ADERR3                        430
#define ADERR4                        431
#define ADERR5                        432
#define ADERR6                        433
#define ADERR7                        434
#define ADERR8                        435
#define ADERRH                        436
#define ADERR9                        437
#define ADERR10                       438
#define ADERR11                       439
#define ADERR12                       440
#define ADERR13                       441
#define ADERR14                       442
#define ADERR15                       443
#define RC1REG                        444
#define TX1REG                        445
#define SP1BRGL                       446
#define SP1BRGH                       447
#define RC1STA                        448
#define RX9D                          449
#define OERR                          450
#define FERR                          451
#define ADDEN                         452
#define CREN                          453
#define SREN                          454
#define RX9                           455
#define SPEN                          456
#define TX1STA                        457
#define TX9D                          458
#define TRMT                          459
#define BRGH                          460
#define SENDB                         461
#define TX1STA_SYNC                   462
#define TXEN                          463
#define TX9                           464
#define CSRC                          465
#define BAUD1CON                      466
#define ABDEN                         467
#define WUE                           468
#define BRG16                         469
#define SCKP                          470
#define RCIDL                         471
#define ABDOVF                        472
#define SSP1BUF                       473
#define SSP1BUF_SSPBUF                474
#define SSP1ADD                       475
#define SSP1ADD_SSPADD                476
#define SSP1MSK                       477
#define SSP1MSK_MSK0                  478
#define SSP1MSK_SSPMSK                479
#define SSP1MSK_MSK1                  480
#define SSP1MSK_MSK2                  481
#define SSP1MSK_MSK3                  482
#define SSP1MSK_MSK4                  483
#define SSP1MSK_MSK5                  484
#define SSP1MSK_MSK6                  485
#define SSP1MSK_MSK7                  486
#define SSP1STAT                      487
#define SSP1STAT_BF                   488
#define SSP1STAT_UA                   489
#define SSP1STAT_nWRITE               490
#define SSP1STAT_nW                   491
#define SSP1STAT_READ_WRITE           492
#define SSP1STAT_I2C_READ             493
#define SSP1STAT_R_W                  494
#define SSP1STAT_R_nW                 495
#define SSP1STAT_S                    496
#define SSP1STAT_I2C_START            497
#define SSP1STAT_P                    498
#define SSP1STAT_I2C_STOP             499
#define SSP1STAT_D_A                  500
#define SSP1STAT_D_nA                 501
#define SSP1STAT_DATA_ADDRESS         502
#define SSP1STAT_nA                   503
#define SSP1STAT_nADDRESS             504
#define SSP1STAT_I2C_DAT              505
#define SSP1STAT_CKE                  506
#define SSP1STAT_SMP                  507
#define SSP1CON1                      508
#define SSP1CON1_SSPM                 509
#define SSP1CON1_SSPM0                510
#define SSP1CON1_SSPM1                511
#define SSP1CON1_SSPM2                512
#define SSP1CON1_SSPM3                513
#define SSP1CON1_CKP                  514
#define SSP1CON1_SSPEN                515
#define SSP1CON1_SSPOV                516
#define SSP1CON1_WCOL                 517
#define SSP1CON2                      518
#define SSP1CON2_SEN                  519
#define SSP1CON2_RSEN                 520
#define SSP1CON2_ADMSK1               521
