tiborsimon/embedded-tdd-headers/pic/8bit/pic16f18877_tdd.h
#define SSP1CON2_ADMSK                522
#define SSP1CON2_ADMSK2               523
#define SSP1CON2_PEN                  524
#define SSP1CON2_RCEN                 525
#define SSP1CON2_ADMSK3               526
#define SSP1CON2_ACKEN                527
#define SSP1CON2_ADMSK4               528
#define SSP1CON2_ACKDT                529
#define SSP1CON2_ADMSK5               530
#define SSP1CON2_ACKSTAT              531
#define SSP1CON2_GCEN                 532
#define SSP1CON3                      533
#define SSP1CON3_DHEN                 534
#define SSP1CON3_AHEN                 535
#define SSP1CON3_SBCDE                536
#define SSP1CON3_SDAHT                537
#define SSP1CON3_BOEN                 538
#define SSP1CON3_SCIE                 539
#define SSP1CON3_PCIE                 540
#define SSP1CON3_ACKTIM               541
#define SSP2BUF                       542
#define SSP2BUF_SSPBUF                543
#define SSP2ADD                       544
#define SSP2ADD_SSPADD                545
#define SSP2MSK                       546
#define SSP2MSK_SSPMSK                547
#define SSP2MSK_MSK0                  548
#define SSP2MSK_MSK1                  549
#define SSP2MSK_MSK2                  550
#define SSP2MSK_MSK3                  551
#define SSP2MSK_MSK4                  552
#define SSP2MSK_MSK5                  553
#define SSP2MSK_MSK6                  554
#define SSP2MSK_MSK7                  555
#define SSP2STAT                      556
#define SSP2STAT_BF                   557
#define SSP2STAT_UA                   558
#define SSP2STAT_R_W                  559
#define SSP2STAT_nWRITE               560
#define SSP2STAT_I2C_READ             561
#define SSP2STAT_READ_WRITE           562
#define SSP2STAT_R_nW                 563
#define SSP2STAT_nW                   564
#define SSP2STAT_I2C_START            565
#define SSP2STAT_S                    566
#define SSP2STAT_I2C_STOP             567
#define SSP2STAT_P                    568
#define SSP2STAT_I2C_DAT              569
#define SSP2STAT_D_nA                 570
#define SSP2STAT_DATA_ADDRESS         571
#define SSP2STAT_nADDRESS             572
#define SSP2STAT_nA                   573
#define SSP2STAT_D_A                  574
#define SSP2STAT_CKE                  575
#define SSP2STAT_SMP                  576
#define SSP2CON1                      577
#define SSP2CON1_SSPM                 578
#define SSP2CON1_SSPM0                579
#define SSP2CON1_SSPM1                580
#define SSP2CON1_SSPM2                581
#define SSP2CON1_SSPM3                582
#define SSP2CON1_CKP                  583
#define SSP2CON1_SSPEN                584
#define SSP2CON1_SSPOV                585
#define SSP2CON1_WCOL                 586
#define SSP2CON2                      587
#define SSP2CON2_SEN                  588
#define SSP2CON2_ADMSK                589
#define SSP2CON2_RSEN                 590
#define SSP2CON2_ADMSK1               591
#define SSP2CON2_PEN                  592
#define SSP2CON2_ADMSK2               593
#define SSP2CON2_RCEN                 594
#define SSP2CON2_ADMSK3               595
#define SSP2CON2_ADMSK4               596
#define SSP2CON2_ACKEN                597
#define SSP2CON2_ADMSK5               598
#define SSP2CON2_ACKDT                599
#define SSP2CON2_ACKSTAT              600
#define SSP2CON2_GCEN                 601
#define SSP2CON3                      602
#define SSP2CON3_DHEN                 603
#define SSP2CON3_AHEN                 604
#define SSP2CON3_SBCDE                605
#define SSP2CON3_SDAHT                606
#define SSP2CON3_BOEN                 607
#define SSP2CON3_SCIE                 608
#define SSP2CON3_PCIE                 609
#define SSP2CON3_ACKTIM               610
#define TMR1L                         611
#define TMR1L0                        612
#define TMR1L1                        613
#define TMR1L2                        614
#define TMR1L3                        615
#define TMR1L4                        616
#define TMR1L5                        617
#define TMR1L6                        618
#define TMR1L7                        619
#define TMR1H0                        620
#define TMR1H                         621
#define TMR1H1                        622
#define TMR1H2                        623
#define TMR1H3                        624
#define TMR1H4                        625
#define TMR1H5                        626
#define TMR1H6                        627
#define TMR1H7                        628
#define T1CON                         629
#define TMR1ON                        630
#define T1CON_ON                      631
#define T1CON_RD16                    632
#define T1RD16                        633
#define nT1SYNC                       634
#define T1CON_nSYNC                   635
#define T1CON_CKPS0                   636
#define T1CKPS0                       637
#define T1CON_CKPS                    638
#define T1CKPS1                       639
#define T1CON_CKPS1                   640
#define T1GCON                        641
#define T1GCON_GVAL                   642
#define T1GVAL                        643
#define T1GGO_nDONE                   644
#define T1GCON_GGO_nDONE              645
#define T1GGO                         646
#define T1GSPM                        647
#define T1GCON_GSPM                   648
#define T1GTM                         649
#define T1GCON_GTM                    650
#define T1GPOL                        651
#define T1GCON_GPOL                   652
#define T1GE                          653
#define T1GCON_GE                     654
#define T1GATE                        655
#define T1GSS0                        656
#define T1GATE_GSS                    657
#define T1GATE_GSS0                   658
#define T1GATE_GSS1                   659
#define T1GSS1                        660
#define T1GSS2                        661
#define T1GATE_GSS2                   662
#define T1GSS3                        663
#define T1GATE_GSS3                   664
#define T1GATE_GSS4                   665
#define T1GSS4                        666
#define T1CLK                         667
#define T1CS0                         668
#define T1CLK_CS                      669
#define T1CLK_CS0                     670
#define T1CLK_CS1                     671
#define T1CS1                         672
#define T1CS2                         673
#define T1CLK_CS2                     674
#define T1CS3                         675
#define T1CLK_CS3                     676
#define TMR3L0                        677
#define TMR3L                         678
#define TMR3L1                        679
#define TMR3L2                        680
#define TMR3L3                        681
#define TMR3L4                        682
#define TMR3L5                        683
#define TMR3L6                        684
#define TMR3L7                        685
#define TMR3H                         686
#define TMR3H0                        687
#define TMR3H1                        688
#define TMR3H2                        689
#define TMR3H3                        690
#define TMR3H4                        691
#define TMR3H5                        692
#define TMR3H6                        693
#define TMR3H7                        694
#define T3CON                         695
#define TMR3ON                        696
#define T3CON_ON                      697
#define T3CON_RD16                    698
#define T3RD16                        699
#define nT3SYNC                       700
#define T3CON_nSYNC                   701
#define T3CKPS0                       702
#define T3CON_CKPS                    703
#define T3CON_CKPS0                   704
#define T3CKPS1                       705
#define T3CON_CKPS1                   706
#define T3GCON                        707
#define T3GVAL                        708
#define T3GCON_GVAL                   709
#define T3GGO                         710
#define T3GCON_GGO_nDONE              711
#define T3GGO_nDONE                   712
#define T3GCON_GSPM                   713
#define T3GSPM                        714
#define T3GTM                         715
#define T3GCON_GTM                    716
#define T3GPOL                        717
#define T3GCON_GPOL                   718
#define T3GCON_GE                     719
#define T3GE                          720
#define T3GATE                        721
#define T3GSS0                        722
#define T3GATE_GSS0                   723
#define T3GATE_GSS                    724
#define T3GATE_GSS1                   725
#define T3GSS1                        726
#define T3GSS2                        727
#define T3GATE_GSS2                   728
#define T3GATE_GSS3                   729
#define T3GSS3                        730
#define T3GATE_GSS4                   731
#define T3GSS4                        732
#define T3CLK                         733
#define T3CLK_CS                      734
#define T3CLK_CS0                     735
#define T3CS0                         736
#define T3CLK_CS1                     737
#define T3CS1                         738
#define T3CLK_CS2                     739
#define T3CS2                         740
#define T3CS3                         741
#define T3CLK_CS3                     742
#define TMR5L                         743
#define TMR5L0                        744
#define TMR5L1                        745
#define TMR5L2                        746
#define TMR5L3                        747
#define TMR5L4                        748
#define TMR5L5                        749
#define TMR5L6                        750
#define TMR5L7                        751
#define TMR5H0                        752
#define TMR5H                         753
#define TMR5H1                        754
#define TMR5H2                        755
#define TMR5H3                        756
#define TMR5H4                        757
#define TMR5H5                        758
#define TMR5H6                        759
#define TMR5H7                        760
#define T5CON                         761
#define T5CON_ON                      762
#define TMR5ON                        763
#define T5CON_RD16                    764
#define T5RD16                        765
#define T5CON_nSYNC                   766
#define nT5SYNC                       767
#define T5CON_CKPS0                   768
#define T5CON_CKPS                    769
#define T5CKPS0                       770
#define T5CON_CKPS1                   771
#define T5CKPS1                       772
#define T5GCON                        773
#define T5GCON_GVAL                   774
#define T5GVAL                        775
#define T5GCON_GGO_nDONE              776
#define T5GGO_nDONE                   777
#define T5GGO                         778
#define T5GCON_GSPM                   779
#define T5GSPM                        780
#define T5GTM                         781
#define T5GCON_GTM                    782
#define T5GPOL                        783
#define T5GCON_GPOL                   784
#define T5GCON_GE                     785
#define T5GE                          786
#define T5GATE                        787
#define T5GATE_GSS0                   788
#define T5GSS0                        789
#define T5GATE_GSS                    790
#define T5GSS1                        791
#define T5GATE_GSS1                   792
#define T5GATE_GSS2                   793
#define T5GSS2                        794
#define T5GATE_GSS3                   795
#define T5GSS3                        796
#define T5GSS4                        797
#define T5GATE_GSS4                   798
#define T5CLK                         799
#define T5CS0                         800
#define T5CLK_CS                      801
#define T5CLK_CS0                     802
#define T5CS1                         803
#define T5CLK_CS1                     804
#define T5CS2                         805
#define T5CLK_CS2                     806
#define T5CS3                         807
#define T5CLK_CS3                     808
#define CCPTMRS0                      809
#define C1TSEL0                       810
#define C1TSEL                        811
#define C1TSEL1                       812
#define C2TSEL0                       813
#define C2TSEL                        814
#define C2TSEL1                       815
#define C3TSEL0                       816
#define C3TSEL                        817
#define C3TSEL1                       818
#define C4TSEL                        819
#define C4TSEL0                       820
#define C4TSEL1                       821
#define CCPTMRS1                      822
#define C5TSEL                        823
#define C5TSEL0                       824
#define C5TSEL1                       825
#define P6TSEL0                       826
#define P6TSEL                        827
#define P6TSEL1                       828
#define P7TSEL0                       829
#define P7TSEL                        830
#define P7TSEL1                       831
#define T2TMR                         832
#define TMR2                          833
#define T2PR                          834
#define PR2                           835
#define T2CON                         836
#define T2OUTPS0                      837
#define T2CON_OUTPS0                  838
#define T2OUTPS                       839
#define T2CON_OUTPS                   840
#define T2OUTPS1                      841
#define T2CON_OUTPS1                  842
#define T2OUTPS2                      843
#define T2CON_OUTPS2                  844
#define T2OUTPS3                      845
#define T2CON_OUTPS3                  846
#define T2CKPS0                       847
#define T2CON_CKPS0                   848
#define T2CON_CKPS                    849
#define T2CKPS                        850
#define T2CKPS1                       851
#define T2CON_CKPS1                   852
#define T2CKPS2                       853
#define T2CON_CKPS2                   854
#define T2CON_ON                      855
#define TMR2ON                        856
#define T2ON                          857
#define T2HLT                         858
#define T2HLT_MODE                    859
#define T2MODE                        860
#define T2MODE0                       861
#define T2HLT_MODE0                   862
#define T2MODE1                       863
#define T2HLT_MODE1                   864
#define T2MODE2                       865
#define T2HLT_MODE2                   866
#define T2MODE3                       867
#define T2HLT_MODE3                   868
#define T2MODE4                       869
#define T2HLT_MODE4                   870
#define T2HLT_CKSYNC                  871
#define T2CKSYNC                      872
#define T2HLT_CKPOL                   873
#define T2CKPOL                       874
#define T2PSYNC                       875
#define T2HLT_PSYNC                   876
#define T2CLKCON                      877
#define T2CS                          878
#define T2CS0                         879
#define T2CS1                         880
#define T2CS2                         881
#define T2CS3                         882
#define T2RST                         883
#define T2RSEL                        884
#define T2RST_RSEL                    885
#define T2RSEL0                       886
#define T2RST_RSEL0                   887
#define T2RSEL1                       888
#define T2RST_RSEL1                   889
#define T2RST_RSEL2                   890
#define T2RSEL2                       891
#define T2RSEL3                       892
#define T2RST_RSEL3                   893
#define T2RSEL4                       894
#define T2RST_RSEL4                   895
#define T4TMR                         896
#define TMR4                          897
#define T4PR                          898
#define PR4                           899
#define T4CON                         900
#define T4CON_OUTPS                   901
#define T4OUTPS0                      902
#define T4OUTPS                       903
#define T4CON_OUTPS0                  904
#define T4OUTPS1                      905
#define T4CON_OUTPS1                  906
#define T4CON_OUTPS2                  907
#define T4OUTPS2                      908
#define T4OUTPS3                      909
#define T4CON_OUTPS3                  910
#define T4CKPS0                       911
#define T4CON_CKPS                    912
#define T4CON_CKPS0                   913
#define T4CKPS                        914
#define T4CKPS1                       915
#define T4CON_CKPS1                   916
#define T4CKPS2                       917
#define T4CON_CKPS2                   918
#define T4ON                          919
#define T4CON_ON                      920
#define TMR4ON                        921
#define T4HLT                         922
#define T4MODE                        923
#define T4HLT_MODE                    924
#define T4HLT_MODE0                   925
#define T4MODE0                       926
#define T4HLT_MODE1                   927
#define T4MODE1                       928
#define T4HLT_MODE2                   929
#define T4MODE2                       930
#define T4HLT_MODE3                   931
#define T4MODE3                       932
#define T4HLT_MODE4                   933
#define T4MODE4                       934
#define T4CKSYNC                      935
#define T4HLT_CKSYNC                  936
#define T4HLT_CKPOL                   937
#define T4CKPOL                       938
#define T4PSYNC                       939
#define T4HLT_PSYNC                   940
#define T4CLKCON                      941
#define T4CS0                         942
#define T4CS                          943
#define T4CS1                         944
#define T4CS2                         945
#define T4CS3                         946
#define T4RST                         947
#define T4RST_RSEL                    948
#define T4RSEL0                       949
#define T4RSEL                        950
#define T4RST_RSEL0                   951
#define T4RSEL1                       952
#define T4RST_RSEL1                   953
#define T4RSEL2                       954
#define T4RST_RSEL2                   955
#define T4RSEL3                       956
#define T4RST_RSEL3                   957
#define T4RSEL4                       958
#define T4RST_RSEL4                   959
#define T6TMR                         960
#define TMR6                          961
#define T6PR                          962
#define PR6                           963
#define T6CON                         964
#define T6CON_OUTPS0                  965
#define T6OUTPS                       966
#define T6CON_OUTPS                   967
#define T6OUTPS0                      968
#define T6CON_OUTPS1                  969
#define T6OUTPS1                      970
#define T6CON_OUTPS2                  971
#define T6OUTPS2                      972
#define T6CON_OUTPS3                  973
#define T6OUTPS3                      974
#define T6CON_CKPS0                   975
#define T6CKPS                        976
#define T6CKPS0                       977
#define T6CON_CKPS                    978
#define T6CON_CKPS1                   979
#define T6CKPS1                       980
#define T6CON_CKPS2                   981
#define T6CKPS2                       982
#define TMR6ON                        983
#define T6ON                          984
#define T6CON_ON                      985
#define T6HLT                         986
#define T6MODE0                       987
#define T6HLT_MODE0                   988
#define T6HLT_MODE                    989
#define T6MODE                        990
#define T6HLT_MODE1                   991
#define T6MODE1                       992
#define T6HLT_MODE2                   993
#define T6MODE2                       994
#define T6HLT_MODE3                   995
#define T6MODE3                       996
#define T6MODE4                       997
#define T6HLT_MODE4                   998
#define T6CKSYNC                      999
#define T6HLT_CKSYNC                  1000
#define T6CKPOL                       1001
#define T6HLT_CKPOL                   1002
#define T6PSYNC                       1003
#define T6HLT_PSYNC                   1004
#define T6CLKCON                      1005
#define T6CS                          1006
#define T6CS0                         1007
#define T6CS1                         1008
#define T6CS2                         1009
#define T6CS3                         1010
#define T6RST                         1011
#define T6RST_RSEL                    1012
#define T6RSEL                        1013
#define T6RSEL0                       1014
#define T6RST_RSEL0                   1015
#define T6RST_RSEL1                   1016
#define T6RSEL1                       1017
#define T6RSEL2                       1018
#define T6RST_RSEL2                   1019
#define T6RST_RSEL3                   1020
#define T6RSEL3                       1021
#define T6RST_RSEL4                   1022
#define T6RSEL4                       1023
#define CCPR1L                        1024
#define CCPR1L_RL                     1025
#define CCPR1H                        1026
#define CCPR1H_RH                     1027
#define CCP1CON                       1028
#define CCP1MODE0                     1029
#define CCP1CON_MODE0                 1030
#define CCP1CON_MODE                  1031
#define CCP1MODE                      1032
#define CCP1MODE1                     1033
#define CCP1CON_MODE1                 1034
#define CCP1MODE2                     1035
#define CCP1CON_MODE2                 1036
#define CCP1MODE3                     1037
#define CCP1CON_MODE3                 1038
#define CCP1FMT                       1039
#define CCP1CON_FMT                   1040
#define CCP1CON_OUT                   1041
#define CCP1OUT                       1042
#define CCP1CON_OE                    1043
#define CCP1OE                        1044
#define CCP1EN                        1045
#define CCP1CON_EN                    1046
#define CCP1CAP                       1047
#define CCP1CTS0                      1048
#define CCP1CAP_CTS                   1049
#define CCP1CAP_CTS0                  1050
#define CCP1CTS                       1051
#define CCP1CTS1                      1052
#define CCP1CAP_CTS1                  1053
#define CCP1CTS2                      1054
#define CCP1CAP_CTS2                  1055
#define CCPR2L                        1056
#define CCPR2L_RL                     1057
#define CCPR2H                        1058
#define CCPR2H_RH                     1059
#define CCP2CON                       1060
#define CCP2MODE                      1061
#define CCP2MODE0                     1062
#define CCP2CON_MODE0                 1063
#define CCP2CON_MODE                  1064
#define CCP2MODE1                     1065
#define CCP2CON_MODE1                 1066
#define CCP2MODE2                     1067
#define CCP2CON_MODE2                 1068
#define CCP2MODE3                     1069
#define CCP2CON_MODE3                 1070
#define CCP2FMT                       1071
#define CCP2CON_FMT                   1072
#define CCP2OUT                       1073
#define CCP2CON_OUT                   1074
#define CCP2OE                        1075
#define CCP2CON_OE                    1076
#define CCP2EN                        1077
#define CCP2CON_EN                    1078
#define CCP2CAP                       1079
#define CCP2CAP_CTS                   1080
#define CCP2CAP_CTS0                  1081
#define CCP2CTS                       1082
#define CCP2CTS0                      1083
#define CCP2CAP_CTS1                  1084
#define CCP2CTS1                      1085
#define CCP2CAP_CTS2                  1086
#define CCP2CTS2                      1087
#define CCPR3L                        1088
#define CCPR3L_RL                     1089
#define CCPR3H                        1090
