tiborsimon/embedded-tdd-headers/pic/8bit/pic16f18877_tdd.h
#define SMT1CPWUP                     1649
#define SMT1STAT_CPWUP                1650
#define SMT1CPRUP                     1651
#define SMT1STAT_CPRUP                1652
#define SMT1CLK                       1653
#define SMT1CLK_CSEL0                 1654
#define SMT1CSEL0                     1655
#define SMT1CSEL                      1656
#define SMT1CLK_CSEL                  1657
#define SMT1CSEL1                     1658
#define SMT1CLK_CSEL1                 1659
#define SMT1CSEL2                     1660
#define SMT1CLK_CSEL2                 1661
#define SMT1SIG                       1662
#define SMT1SSEL                      1663
#define SMT1SIG_SSEL0                 1664
#define SMT1SIG_SSEL                  1665
#define SMT1SSEL0                     1666
#define SMT1SIG_SSEL1                 1667
#define SMT1SSEL1                     1668
#define SMT1SIG_SSEL2                 1669
#define SMT1SSEL2                     1670
#define SMT1SIG_SSEL3                 1671
#define SMT1SSEL3                     1672
#define SMT1SIG_SSEL4                 1673
#define SMT1SSEL4                     1674
#define SMT1WIN                       1675
#define SMT1WSEL                      1676
#define SMT1WSEL0                     1677
#define SMT1WIN_WSEL0                 1678
#define SMT1WIN_WSEL                  1679
#define SMT1WSEL1                     1680
#define SMT1WIN_WSEL1                 1681
#define SMT1WIN_WSEL2                 1682
#define SMT1WSEL2                     1683
#define SMT1WIN_WSEL3                 1684
#define SMT1WSEL3                     1685
#define SMT1WIN_WSEL4                 1686
#define SMT1WSEL4                     1687
#define SMT2TMRL                      1688
#define SMT2TMRL_SMT2TMR              1689
#define SMT2TMR0                      1690
#define SMT2TMR1                      1691
#define SMT2TMR2                      1692
#define SMT2TMR3                      1693
#define SMT2TMR4                      1694
#define SMT2TMR5                      1695
#define SMT2TMR6                      1696
#define SMT2TMR7                      1697
#define SMT2TMRH                      1698
#define SMT2TMR8                      1699
#define SMT2TMRH_SMT2TMR              1700
#define SMT2TMR9                      1701
#define SMT2TMR10                     1702
#define SMT2TMR11                     1703
#define SMT2TMR12                     1704
#define SMT2TMR13                     1705
#define SMT2TMR14                     1706
#define SMT2TMR15                     1707
#define SMT2TMRU                      1708
#define SMT2TMR16                     1709
#define SMT2TMRU_SMT2TMR              1710
#define SMT2TMR17                     1711
#define SMT2TMR18                     1712
#define SMT2TMR19                     1713
#define SMT2TMR20                     1714
#define SMT2TMR21                     1715
#define SMT2TMR22                     1716
#define SMT2TMR23                     1717
#define SMT2CPRL                      1718
#define SMT2CPRL_CPR0                 1719
#define SMT2CPRL_SMT2CPR              1720
#define SMT2CPRL_CPR                  1721
#define SMT2CPRL_CPR1                 1722
#define SMT2CPRL_CPR2                 1723
#define SMT2CPRL_CPR3                 1724
#define SMT2CPRL_CPR4                 1725
#define SMT2CPRL_CPR5                 1726
#define SMT2CPRL_CPR6                 1727
#define SMT2CPRL_CPR7                 1728
#define SMT2CPRH                      1729
#define SMT2CPRH_CPR8                 1730
#define SMT2CPRH_SMT2CPR              1731
#define SMT2CPR8                      1732
#define SMT2CPRH_CPR                  1733
#define SMT2CPRH_CPR9                 1734
#define SMT2CPR9                      1735
#define SMT2CPRH_CPR10                1736
#define SMT2CPR10                     1737
#define SMT2CPRH_CPR11                1738
#define SMT2CPR11                     1739
#define SMT2CPRH_CPR12                1740
#define SMT2CPR12                     1741
#define SMT2CPRH_CPR13                1742
#define SMT2CPR13                     1743
#define SMT2CPRH_CPR14                1744
#define SMT2CPR14                     1745
#define SMT2CPRH_CPR15                1746
#define SMT2CPR15                     1747
#define SMT2CPRU                      1748
#define SMT2CPRU_CPR16                1749
#define SMT2CPRU_CPR                  1750
#define SMT2CPRU_SMT2CPR              1751
#define SMT2CPR16                     1752
#define SMT2CPRU_CPR17                1753
#define SMT2CPR17                     1754
#define SMT2CPRU_CPR18                1755
#define SMT2CPR18                     1756
#define SMT2CPRU_CPR19                1757
#define SMT2CPR19                     1758
#define SMT2CPR20                     1759
#define SMT2CPRU_CPR20                1760
#define SMT2CPR21                     1761
#define SMT2CPRU_CPR21                1762
#define SMT2CPR22                     1763
#define SMT2CPRU_CPR22                1764
#define SMT2CPR23                     1765
#define SMT2CPRU_CPR23                1766
#define SMT2CPWL                      1767
#define SMT2CPW0                      1768
#define SMT2CPWL_CPW0                 1769
#define SMT2CPWL_CPW                  1770
#define SMT2CPWL_SMT2CPW              1771
#define SMT2CPW1                      1772
#define SMT2CPWL_CPW1                 1773
#define SMT2CPW2                      1774
#define SMT2CPWL_CPW2                 1775
#define SMT2CPW3                      1776
#define SMT2CPWL_CPW3                 1777
#define SMT2CPW4                      1778
#define SMT2CPWL_CPW4                 1779
#define SMT2CPW5                      1780
#define SMT2CPWL_CPW5                 1781
#define SMT2CPW6                      1782
#define SMT2CPWL_CPW6                 1783
#define SMT2CPW7                      1784
#define SMT2CPWL_CPW7                 1785
#define SMT2CPWH                      1786
#define SMT2CPWH_CPW8                 1787
#define SMT2CPW8                      1788
#define SMT2CPWH_SMT2CPW              1789
#define SMT2CPWH_CPW                  1790
#define SMT2CPWH_CPW9                 1791
#define SMT2CPW9                      1792
#define SMT2CPWH_CPW10                1793
#define SMT2CPW10                     1794
#define SMT2CPW11                     1795
#define SMT2CPWH_CPW11                1796
#define SMT2CPWH_CPW12                1797
#define SMT2CPW12                     1798
#define SMT2CPWH_CPW13                1799
#define SMT2CPW13                     1800
#define SMT2CPW14                     1801
#define SMT2CPWH_CPW14                1802
#define SMT2CPW15                     1803
#define SMT2CPWH_CPW15                1804
#define SMT2CPWU                      1805
#define SMT2CPWU_CPW16                1806
#define SMT2CPW16                     1807
#define SMT2CPWU_SMT2CPW              1808
#define SMT2CPWU_CPW                  1809
#define SMT2CPWU_CPW17                1810
#define SMT2CPW17                     1811
#define SMT2CPWU_CPW18                1812
#define SMT2CPW18                     1813
#define SMT2CPWU_CPW19                1814
#define SMT2CPW19                     1815
#define SMT2CPW20                     1816
#define SMT2CPWU_CPW20                1817
#define SMT2CPW21                     1818
#define SMT2CPWU_CPW21                1819
#define SMT2CPW22                     1820
#define SMT2CPWU_CPW22                1821
#define SMT2CPW23                     1822
#define SMT2CPWU_CPW23                1823
#define SMT2PRL                       1824
#define SMT2PRL_SMT2PR                1825
#define SMT2PR0                       1826
#define SMT2PR1                       1827
#define SMT2PR2                       1828
#define SMT2PR3                       1829
#define SMT2PR4                       1830
#define SMT2PR5                       1831
#define SMT2PR6                       1832
#define SMT2PR7                       1833
#define SMT2PRH                       1834
#define SMT2PRH_SMT2PR                1835
#define SMT2PR8                       1836
#define SMT2PR9                       1837
#define SMT2PR10                      1838
#define SMT2PR11                      1839
#define SMT2PR12                      1840
#define SMT2PR13                      1841
#define SMT2PR14                      1842
#define SMT2PR15                      1843
#define SMT2PRU                       1844
#define SMT2PRU_SMT2PR                1845
#define SMT2PR16                      1846
#define SMT2PR17                      1847
#define SMT2PR18                      1848
#define SMT2PR19                      1849
#define SMT2PR20                      1850
#define SMT2PR21                      1851
#define SMT2PR22                      1852
#define SMT2PR23                      1853
#define SMT2CON0                      1854
#define SMT2PS0                       1855
#define SMT2PS                        1856
#define SMT2PS1                       1857
#define SMT2CON0_CPOL                 1858
#define SMT2CON0_SPOL                 1859
#define SMT2CON0_WPOL                 1860
#define SMT2CON0_STP                  1861
#define SMT2CON0_EN                   1862
#define SMT2EN                        1863
#define SMT2CON1                      1864
#define SMT2CON1_MODE                 1865
#define SMT2CON1_MODE0                1866
#define SMT2CON1_MODE1                1867
#define SMT2CON1_MODE2                1868
#define SMT2CON1_MODE3                1869
#define SMT2CON1_REPEAT               1870
#define SMT2GO                        1871
#define SMT2STAT                      1872
#define SMT2AS                        1873
#define SMT2STAT_AS                   1874
#define SMT2WS                        1875
#define SMT2STAT_WS                   1876
#define SMT2STAT_TS                   1877
#define SMT2TS                        1878
#define SMT2RESET                     1879
#define SMT2STAT_RST                  1880
#define SMT2CPWUP                     1881
#define SMT2STAT_CPWUP                1882
#define SMT2STAT_CPRUP                1883
#define SMT2CPRUP                     1884
#define SMT2CLK                       1885
#define SMT2CLK_CSEL                  1886
#define SMT2CLK_CSEL0                 1887
#define SMT2CSEL0                     1888
#define SMT2CSEL                      1889
#define SMT2CLK_CSEL1                 1890
#define SMT2CSEL1                     1891
#define SMT2CLK_CSEL2                 1892
#define SMT2CSEL2                     1893
#define SMT2SIG                       1894
#define SMT2SIG_SSEL                  1895
#define SMT2SSEL0                     1896
#define SMT2SSEL                      1897
#define SMT2SIG_SSEL0                 1898
#define SMT2SSEL1                     1899
#define SMT2SIG_SSEL1                 1900
#define SMT2SSEL2                     1901
#define SMT2SIG_SSEL2                 1902
#define SMT2SIG_SSEL3                 1903
#define SMT2SSEL3                     1904
#define SMT2SSEL4                     1905
#define SMT2SIG_SSEL4                 1906
#define SMT2WIN                       1907
#define SMT2WIN_WSEL0                 1908
#define SMT2WSEL0                     1909
#define SMT2WSEL                      1910
#define SMT2WIN_WSEL                  1911
#define SMT2WSEL1                     1912
#define SMT2WIN_WSEL1                 1913
#define SMT2WSEL2                     1914
#define SMT2WIN_WSEL2                 1915
#define SMT2WSEL3                     1916
#define SMT2WIN_WSEL3                 1917
#define SMT2WSEL4                     1918
#define SMT2WIN_WSEL4                 1919
#define NCO1ACCL                      1920
#define NCO1ACCL_NCO1ACC              1921
#define NCO1ACC0                      1922
#define NCO1ACC1                      1923
#define NCO1ACC2                      1924
#define NCO1ACC3                      1925
#define NCO1ACC4                      1926
#define NCO1ACC5                      1927
#define NCO1ACC6                      1928
#define NCO1ACC7                      1929
#define NCO1ACCH                      1930
#define NCO1ACC8                      1931
#define NCO1ACCH_NCO1ACC              1932
#define NCO1ACC9                      1933
#define NCO1ACC10                     1934
#define NCO1ACC11                     1935
#define NCO1ACC12                     1936
#define NCO1ACC13                     1937
#define NCO1ACC14                     1938
#define NCO1ACC15                     1939
#define NCO1ACCU                      1940
#define NCO1ACCU_NCO1ACC              1941
#define NCO1ACC16                     1942
#define NCO1ACC17                     1943
#define NCO1ACC18                     1944
#define NCO1ACC19                     1945
#define NCO1INCL                      1946
#define NCO1INC0                      1947
#define NCO1INCL_NCO1INC              1948
#define NCO1INC1                      1949
#define NCO1INC2                      1950
#define NCO1INC3                      1951
#define NCO1INC4                      1952
#define NCO1INC5                      1953
#define NCO1INC6                      1954
#define NCO1INC7                      1955
#define NCO1INCH                      1956
#define NCO1INCH_NCO1INC              1957
#define NCO1INC8                      1958
#define NCO1INC9                      1959
#define NCO1INC10                     1960
#define NCO1INC11                     1961
#define NCO1INC12                     1962
#define NCO1INC13                     1963
#define NCO1INC14                     1964
#define NCO1INC15                     1965
#define NCO1INCU                      1966
#define NCO1INC16                     1967
#define NCO1INCU_NCO1INC              1968
#define NCO1INC17                     1969
#define NCO1INC18                     1970
#define NCO1INC19                     1971
#define NCO1CON                       1972
#define N1PFM                         1973
#define N1POL                         1974
#define N1OUT                         1975
#define N1EN                          1976
#define NCO1CLK                       1977
#define N1CKS                         1978
#define N1CKS0                        1979
#define N1CKS1                        1980
#define N1CKS2                        1981
#define N1PWS0                        1982
#define N1PWS                         1983
#define N1PWS1                        1984
#define N1PWS2                        1985
#define CWG1CLKCON                    1986
#define CWG1CLKCON_CS                 1987
#define CWG1CS                        1988
#define CWG1ISM                       1989
#define CWG1ISM_IS                    1990
#define CWG1ISM0                      1991
#define CWG1ISM1                      1992
#define CWG1ISM2                      1993
#define CWG1ISM3                      1994
#define CWG1DBR_DBR                   1995
#define CWG1DBR0                      1996
#define CWG1DBR_DBR0                  1997
#define CWG1DBR                       1998
#define CWG1DBR1                      1999
#define CWG1DBR_DBR1                  2000
#define CWG1DBR2                      2001
#define CWG1DBR_DBR2                  2002
#define CWG1DBR3                      2003
#define CWG1DBR_DBR3                  2004
#define CWG1DBR_DBR4                  2005
#define CWG1DBR4                      2006
#define CWG1DBR5                      2007
#define CWG1DBR_DBR5                  2008
#define CWG1DBF                       2009
#define CWG1DBF0                      2010
#define CWG1DBF_DBF                   2011
#define CWG1DBF_DBF0                  2012
#define CWG1DBF1                      2013
#define CWG1DBF_DBF1                  2014
#define CWG1DBF_DBF2                  2015
#define CWG1DBF2                      2016
#define CWG1DBF3                      2017
#define CWG1DBF_DBF3                  2018
#define CWG1DBF_DBF4                  2019
#define CWG1DBF4                      2020
#define CWG1DBF_DBF5                  2021
#define CWG1DBF5                      2022
#define CWG1CON0                      2023
#define CWG1MODE0                     2024
#define CWG1CON0_MODE0                2025
#define CWG1MODE                      2026
#define CWG1CON0_MODE                 2027
#define CWG1MODE1                     2028
#define CWG1CON0_MODE1                2029
#define CWG1MODE2                     2030
#define CWG1CON0_MODE2                2031
#define CWG1CON0_LD                   2032
#define CWG1LD                        2033
#define CWG1CON0_EN                   2034
#define CWG1EN                        2035
#define G1EN                          2036
#define CWG1CON1                      2037
#define CWG1POLA                      2038
#define CWG1CON1_POLA                 2039
#define CWG1CON1_POLB                 2040
#define CWG1POLB                      2041
#define CWG1POLC                      2042
#define CWG1CON1_POLC                 2043
#define CWG1CON1_POLD                 2044
#define CWG1POLD                      2045
#define CWG1CON1_IN                   2046
#define CWG1IN                        2047
#define CWG1AS0                       2048
#define CWG1LSAC                      2049
#define CWG1AS0_LSAC0                 2050
#define CWG1AS0_LSAC                  2051
#define CWG1LSAC0                     2052
#define CWG1AS0_LSAC1                 2053
#define CWG1LSAC1                     2054
#define CWG1AS0_LSBD0                 2055
#define CWG1LSBD0                     2056
#define CWG1LSBD                      2057
#define CWG1AS0_LSBD                  2058
#define CWG1LSBD1                     2059
#define CWG1AS0_LSBD1                 2060
#define CWG1AS0_REN                   2061
#define CWG1REN                       2062
#define CWG1AS0_SHUTDOWN              2063
#define CWG1SHUTDOWN                  2064
#define CWG1AS1                       2065
#define CWG1AS1_AS0E                  2066
#define CWG1AS1_AS1E                  2067
#define CWG1AS1_AS2E                  2068
#define CWG1AS1_AS3E                  2069
#define CWG1AS1_AS4E                  2070
#define CWG1AS1_AS5E                  2071
#define CWG1AS1_AS6E                  2072
#define CWG1STR                       2073
#define CWG1STRA                      2074
#define CWG1STR_STRA                  2075
#define CWG1STRB                      2076
#define CWG1STR_STRB                  2077
#define CWG1STRC                      2078
#define CWG1STR_STRC                  2079
#define CWG1STR_STRD                  2080
#define CWG1STRD                      2081
#define CWG1OVRA                      2082
#define CWG1STR_OVRA                  2083
#define CWG1OVRB                      2084
#define CWG1STR_OVRB                  2085
#define CWG1OVRC                      2086
#define CWG1STR_OVRC                  2087
#define CWG1OVRD                      2088
#define CWG1STR_OVRD                  2089
#define CWG2CLKCON                    2090
#define CWG2CS                        2091
#define CWG2CLKCON_CS                 2092
#define CWG2ISM                       2093
#define CWG2ISM0                      2094
#define CWG2ISM_IS                    2095
#define CWG2ISM1                      2096
#define CWG2ISM2                      2097
#define CWG2ISM3                      2098
#define CWG2DBR_DBR                   2099
#define CWG2DBR_DBR0                  2100
#define CWG2DBR                       2101
#define CWG2DBR0                      2102
#define CWG2DBR_DBR1                  2103
#define CWG2DBR1                      2104
#define CWG2DBR_DBR2                  2105
#define CWG2DBR2                      2106
#define CWG2DBR_DBR3                  2107
#define CWG2DBR3                      2108
#define CWG2DBR_DBR4                  2109
#define CWG2DBR4                      2110
#define CWG2DBR_DBR5                  2111
#define CWG2DBR5                      2112
#define CWG2DBF                       2113
#define CWG2DBF_DBF0                  2114
#define CWG2DBF_DBF                   2115
#define CWG2DBF0                      2116
#define CWG2DBF_DBF1                  2117
#define CWG2DBF1                      2118
#define CWG2DBF_DBF2                  2119
#define CWG2DBF2                      2120
#define CWG2DBF_DBF3                  2121
#define CWG2DBF3                      2122
#define CWG2DBF_DBF4                  2123
#define CWG2DBF4                      2124
#define CWG2DBF5                      2125
#define CWG2DBF_DBF5                  2126
#define CWG2CON0                      2127
#define CWG2MODE                      2128
#define CWG2MODE0                     2129
#define CWG2CON0_MODE                 2130
#define CWG2CON0_MODE0                2131
#define CWG2MODE1                     2132
#define CWG2CON0_MODE1                2133
#define CWG2MODE2                     2134
#define CWG2CON0_MODE2                2135
#define CWG2LD                        2136
#define CWG2CON0_LD                   2137
#define CWG2CON0_EN                   2138
#define CWG2EN                        2139
#define G2EN                          2140
#define CWG2CON1                      2141
#define CWG2POLA                      2142
#define CWG2CON1_POLA                 2143
#define CWG2POLB                      2144
#define CWG2CON1_POLB                 2145
#define CWG2POLC                      2146
#define CWG2CON1_POLC                 2147
#define CWG2CON1_POLD                 2148
#define CWG2POLD                      2149
#define CWG2IN                        2150
#define CWG2CON1_IN                   2151
#define CWG2AS0                       2152
#define CWG2LSAC                      2153
#define CWG2AS0_LSAC                  2154
#define CWG2LSAC0                     2155
#define CWG2AS0_LSAC0                 2156
#define CWG2LSAC1                     2157
#define CWG2AS0_LSAC1                 2158
#define CWG2AS0_LSBD0                 2159
#define CWG2LSBD                      2160
#define CWG2AS0_LSBD                  2161
#define CWG2LSBD0                     2162
#define CWG2AS0_LSBD1                 2163
#define CWG2LSBD1                     2164
#define CWG2AS0_REN                   2165
#define CWG2REN                       2166
#define CWG2AS0_SHUTDOWN              2167
#define CWG2SHUTDOWN                  2168
#define CWG2AS1                       2169
#define CWG2AS1_AS0E                  2170
#define CWG2AS1_AS1E                  2171
#define CWG2AS1_AS2E                  2172
#define CWG2AS1_AS3E                  2173
#define CWG2AS1_AS4E                  2174
#define CWG2AS1_AS5E                  2175
#define CWG2AS1_AS6E                  2176
#define CWG2STR                       2177
#define CWG2STR_STRA                  2178
#define CWG2STRA                      2179
#define CWG2STR_STRB                  2180
#define CWG2STRB                      2181
#define CWG2STR_STRC                  2182
#define CWG2STRC                      2183
#define CWG2STR_STRD                  2184
#define CWG2STRD                      2185
#define CWG2STR_OVRA                  2186
#define CWG2OVRA                      2187
#define CWG2OVRB                      2188
#define CWG2STR_OVRB                  2189
#define CWG2STR_OVRC                  2190
#define CWG2OVRC                      2191
#define CWG2OVRD                      2192
#define CWG2STR_OVRD                  2193
#define CWG3CLKCON                    2194
#define CWG3CS                        2195
#define CWG3CLKCON_CS                 2196
#define CWG3ISM                       2197
#define CWG3ISM_IS                    2198
#define CWG3ISM0                      2199
#define CWG3ISM1                      2200
#define CWG3ISM2                      2201
#define CWG3ISM3                      2202
#define CWG3DBR                       2203
#define CWG3DBR0                      2204
#define CWG3DBR_DBR0                  2205
#define CWG3DBR_DBR                   2206
