tiborsimon/embedded-tdd-headers/pic/8bit/pic16f18877_tdd.h
#define C1PCH                         2765
#define C1PCH0                        2766
#define CM1PSEL_PCH0                  2767
#define C1PCH1                        2768
#define CM1PSEL_PCH1                  2769
#define C1PCH2                        2770
#define CM1PSEL_PCH2                  2771
#define CM2CON0                       2772
#define CM2CON0_SYNC                  2773
#define C2SYNC                        2774
#define C2HYS                         2775
#define CM2CON0_HYS                   2776
#define C2SP                          2777
#define C2POL                         2778
#define CM2CON0_POL                   2779
#define CM2CON0_C2OUT                 2780
#define CM2CON0_OUT                   2781
#define CM2CON0_ON                    2782
#define C2ON                          2783
#define CM2CON1                       2784
#define C2INTN                        2785
#define CM2CON1_INTN                  2786
#define CM2CON1_INTP                  2787
#define C2INTP                        2788
#define CM2NSEL                       2789
#define C2NCH0                        2790
#define CM2NSEL_NCH0                  2791
#define C2NCH                         2792
#define CM2NSEL_NCH                   2793
#define C2NCH1                        2794
#define CM2NSEL_NCH1                  2795
#define C2NCH2                        2796
#define CM2NSEL_NCH2                  2797
#define CM2PSEL                       2798
#define CM2PSEL_PCH                   2799
#define C2PCH                         2800
#define C2PCH0                        2801
#define CM2PSEL_PCH0                  2802
#define C2PCH1                        2803
#define CM2PSEL_PCH1                  2804
#define CM2PSEL_PCH2                  2805
#define C2PCH2                        2806
#define CLCDATA                       2807
#define MLC1OUT                       2808
#define MLC2OUT                       2809
#define MLC3OUT                       2810
#define MLC4OUT                       2811
#define CLC1CON                       2812
#define CLC1CON_MODE                  2813
#define LC1MODE0                      2814
#define LC1MODE                       2815
#define CLC1CON_MODE0                 2816
#define LC1MODE1                      2817
#define CLC1CON_MODE1                 2818
#define LC1MODE2                      2819
#define CLC1CON_MODE2                 2820
#define LC1INTN                       2821
#define CLC1CON_INTN                  2822
#define LC1INTP                       2823
#define CLC1CON_INTP                  2824
#define LC1OUT                        2825
#define CLC1CON_OUT                   2826
#define LC1EN                         2827
#define CLC1CON_EN                    2828
#define CLC1POL                       2829
#define LC1G1POL                      2830
#define CLC1POL_G1POL                 2831
#define CLC1POL_G2POL                 2832
#define LC1G2POL                      2833
#define LC1G3POL                      2834
#define CLC1POL_G3POL                 2835
#define LC1G4POL                      2836
#define CLC1POL_G4POL                 2837
#define CLC1POL_POL                   2838
#define LC1POL                        2839
#define CLC1SEL0                      2840
#define LC1D1S                        2841
#define CLC1SEL0_D1S0                 2842
#define LC1D1S0                       2843
#define CLC1SEL0_D1S                  2844
#define CLC1SEL0_D1S1                 2845
#define LC1D1S1                       2846
#define CLC1SEL0_D1S2                 2847
#define LC1D1S2                       2848
#define CLC1SEL0_D1S3                 2849
#define LC1D1S3                       2850
#define LC1D1S4                       2851
#define CLC1SEL0_D1S4                 2852
#define CLC1SEL0_D1S5                 2853
#define LC1D1S5                       2854
#define LC1D1S6                       2855
#define CLC1SEL0_D1S6                 2856
#define LC1D1S7                       2857
#define CLC1SEL0_D1S7                 2858
#define CLC1SEL1                      2859
#define CLC1SEL1_D2S                  2860
#define CLC1SEL1_D2S0                 2861
#define LC1D2S0                       2862
#define LC1D2S                        2863
#define CLC1SEL1_D2S1                 2864
#define LC1D2S1                       2865
#define CLC1SEL1_D2S2                 2866
#define LC1D2S2                       2867
#define CLC1SEL1_D2S3                 2868
#define LC1D2S3                       2869
#define LC1D2S4                       2870
#define CLC1SEL1_D2S4                 2871
#define D2S5                          2872
#define LC1D2S5                       2873
#define LC1D2S6                       2874
#define CLC1SEL1_D2S6                 2875
#define CLC1SEL1_D2S7                 2876
#define LC1D2S7                       2877
#define CLC1SEL2                      2878
#define CLC1SEL2_D3S                  2879
#define LC1D3S0                       2880
#define LC1D3S                        2881
#define CLC1SEL2_D3S0                 2882
#define LC1D3S1                       2883
#define CLC1SEL2_D3S1                 2884
#define LC1D3S2                       2885
#define CLC1SEL2_D3S2                 2886
#define LC1D3S3                       2887
#define CLC1SEL2_D3S3                 2888
#define LC1D3S4                       2889
#define CLC1SEL2_D3S4                 2890
#define LC1D3S5                       2891
#define CLC1SEL2_D3S5                 2892
#define LC1D3S6                       2893
#define CLC1SEL2_D3S6                 2894
#define LC1D3S7                       2895
#define CLC1SEL2_D3S7                 2896
#define CLC1SEL3                      2897
#define LC1D4S                        2898
#define CLC1SEL3_D4S                  2899
#define LC1D4S0                       2900
#define CLC1SEL3_D4S0                 2901
#define LC1D4S1                       2902
#define CLC1SEL3_D4S1                 2903
#define LC1D4S2                       2904
#define CLC1SEL3_D4S2                 2905
#define LC1D4S3                       2906
#define CLC1SEL3_D4S3                 2907
#define LC1D4S4                       2908
#define CLC1SEL3_D4S4                 2909
#define LC1D4S5                       2910
#define CLC1SEL3_D4S5                 2911
#define LC1D4S6                       2912
#define CLC1SEL3_D4S6                 2913
#define LC1D4S7                       2914
#define CLC1SEL3_D4S7                 2915
#define CLC1GLS0                      2916
#define CLC1GLS0_D1N                  2917
#define LC1G1D1N                      2918
#define CLC1GLS0_D1T                  2919
#define LC1G1D1T                      2920
#define LC1G1D2N                      2921
#define CLC1GLS0_D2N                  2922
#define LC1G1D2T                      2923
#define CLC1GLS0_D2T                  2924
#define CLC1GLS0_D3N                  2925
#define LC1G1D3N                      2926
#define CLC1GLS0_D3T                  2927
#define LC1G1D3T                      2928
#define CLC1GLS0_D4N                  2929
#define LC1G1D4N                      2930
#define CLC1GLS0_D4T                  2931
#define LC1G1D4T                      2932
#define CLC1GLS1                      2933
#define CLC1GLS1_D1N                  2934
#define LC1G2D1N                      2935
#define LC1G2D1T                      2936
#define CLC1GLS1_D1T                  2937
#define CLC1GLS1_D2N                  2938
#define LC1G2D2N                      2939
#define LC1G2D2T                      2940
#define CLC1GLS1_D2T                  2941
#define CLC1GLS1_D3N                  2942
#define LC1G2D3N                      2943
#define LC1G2D3T                      2944
#define CLC1GLS1_D3T                  2945
#define CLC1GLS1_D4N                  2946
#define LC1G2D4N                      2947
#define LC1G2D4T                      2948
#define CLC1GLS1_D4T                  2949
#define CLC1GLS2                      2950
#define CLC1GLS2_D1N                  2951
#define LC1G3D1N                      2952
#define LC1G3D1T                      2953
#define CLC1GLS2_D1T                  2954
#define LC1G3D2N                      2955
#define CLC1GLS2_D2N                  2956
#define LC1G3D2T                      2957
#define CLC1GLS2_D2T                  2958
#define CLC1GLS2_D3N                  2959
#define LC1G3D3N                      2960
#define LC1G3D3T                      2961
#define CLC1GLS2_D3T                  2962
#define LC1G3D4N                      2963
#define CLC1GLS2_D4N                  2964
#define LC1G3D4T                      2965
#define CLC1GLS2_D4T                  2966
#define CLC1GLS3                      2967
#define LC1G4D1N                      2968
#define CLC1GLS3_G4D1N                2969
#define LC1G4D1T                      2970
#define CLC1GLS3_G4D1T                2971
#define CLC1GLS3_G4D2N                2972
#define LC1G4D2N                      2973
#define CLC1GLS3_G4D2T                2974
#define LC1G4D2T                      2975
#define LC1G4D3N                      2976
#define CLC1GLS3_G4D3N                2977
#define LC1G4D3T                      2978
#define CLC1GLS3_G4D3T                2979
#define CLC1GLS3_G4D4N                2980
#define LC1G4D4N                      2981
#define CLC1GLS3_G4D4T                2982
#define LC1G4D4T                      2983
#define CLC2CON                       2984
#define LC2MODE0                      2985
#define CLC2CON_MODE                  2986
#define LC2MODE                       2987
#define CLC2CON_MODE0                 2988
#define LC2MODE1                      2989
#define CLC2CON_MODE1                 2990
#define LC2MODE2                      2991
#define CLC2CON_MODE2                 2992
#define LC2INTN                       2993
#define CLC2CON_INTN                  2994
#define LC2INTP                       2995
#define CLC2CON_INTP                  2996
#define CLC2CON_OUT                   2997
#define LC2OUT                        2998
#define CLC2CON_EN                    2999
#define LC2EN                         3000
#define CLC2POL                       3001
#define LC2G1POL                      3002
#define CLC2POL_G1POL                 3003
#define LC2G2POL                      3004
#define CLC2POL_G2POL                 3005
#define LC2G3POL                      3006
#define CLC2POL_G3POL                 3007
#define LC2G4POL                      3008
#define CLC2POL_G4POL                 3009
#define CLC2POL_POL                   3010
#define LC2POL                        3011
#define CLC2SEL0                      3012
#define CLC2SEL0_D1S                  3013
#define LC2D1S                        3014
#define LC2D1S0                       3015
#define CLC2SEL0_D1S0                 3016
#define LC2D1S1                       3017
#define CLC2SEL0_D1S1                 3018
#define LC2D1S2                       3019
#define CLC2SEL0_D1S2                 3020
#define LC2D1S3                       3021
#define CLC2SEL0_D1S3                 3022
#define LC2D1S4                       3023
#define CLC2SEL0_D1S4                 3024
#define LC2D1S5                       3025
#define CLC2SEL0_D1S5                 3026
#define LC2D1S6                       3027
#define CLC2SEL0_D1S6                 3028
#define LC2D1S7                       3029
#define CLC2SEL0_D1S7                 3030
#define CLC2SEL1                      3031
#define LC2D2S0                       3032
#define LC2D2S                        3033
#define CLC2SEL1_D2S                  3034
#define CLC2SEL1_D2S0                 3035
#define LC2D2S1                       3036
#define CLC2SEL1_D2S1                 3037
#define LC2D2S2                       3038
#define CLC2SEL1_D2S2                 3039
#define LC2D2S3                       3040
#define CLC2SEL1_D2S3                 3041
#define LC2D2S4                       3042
#define CLC2SEL1_D2S4                 3043
#define LC2D2S5                       3044
#define CLC2SEL1_D2S5                 3045
#define LC2D2S6                       3046
#define CLC2SEL1_D2S6                 3047
#define LC2D2S7                       3048
#define CLC2SEL1_D2S7                 3049
#define CLC2SEL2                      3050
#define CLC2SEL2_D3S0                 3051
#define LC2D3S                        3052
#define CLC2SEL2_D3S                  3053
#define LC2D3S0                       3054
#define CLC2SEL2_D3S1                 3055
#define LC2D3S1                       3056
#define CLC2SEL2_D3S2                 3057
#define LC2D3S2                       3058
#define CLC2SEL2_D3S3                 3059
#define LC2D3S3                       3060
#define CLC2SEL2_D3S4                 3061
#define LC2D3S4                       3062
#define CLC2SEL2_D3S5                 3063
#define LC2D3S5                       3064
#define CLC2SEL2_D3S6                 3065
#define LC2D3S6                       3066
#define CLC2SEL2_D3S7                 3067
#define LC2D3S7                       3068
#define CLC2SEL3                      3069
#define LC2D4S                        3070
#define CLC2SEL3_D4S0                 3071
#define LC2D4S0                       3072
#define CLC2SEL3_D4S                  3073
#define CLC2SEL3_D4S1                 3074
#define LC2D4S1                       3075
#define CLC2SEL3_D4S2                 3076
#define LC2D4S2                       3077
#define CLC2SEL3_D4S3                 3078
#define LC2D4S3                       3079
#define CLC2SEL3_D4S4                 3080
#define LC2D4S4                       3081
#define CLC2SEL3_D4S5                 3082
#define LC2D4S5                       3083
#define CLC2SEL3_D4S6                 3084
#define LC2D4S6                       3085
#define CLC2SEL3_D4S7                 3086
#define LC2D4S7                       3087
#define CLC2GLS0                      3088
#define LC2G1D1N                      3089
#define CLC2GLS0_D1N                  3090
#define CLC2GLS0_D1T                  3091
#define LC2G1D1T                      3092
#define LC2G1D2N                      3093
#define CLC2GLS0_D2N                  3094
#define CLC2GLS0_D2T                  3095
#define LC2G1D2T                      3096
#define LC2G1D3N                      3097
#define CLC2GLS0_D3N                  3098
#define CLC2GLS0_D3T                  3099
#define LC2G1D3T                      3100
#define LC2G1D4N                      3101
#define CLC2GLS0_D4N                  3102
#define CLC2GLS0_D4T                  3103
#define LC2G1D4T                      3104
#define CLC2GLS1                      3105
#define CLC2GLS1_D1N                  3106
#define LC2G2D1N                      3107
#define CLC2GLS1_D1T                  3108
#define LC2G2D1T                      3109
#define CLC2GLS1_D2N                  3110
#define LC2G2D2N                      3111
#define CLC2GLS1_D2T                  3112
#define LC2G2D2T                      3113
#define LC2G2D3N                      3114
#define CLC2GLS1_D3N                  3115
#define LC2G2D3T                      3116
#define CLC2GLS1_D3T                  3117
#define LC2G2D4N                      3118
#define CLC2GLS1_D4N                  3119
#define LC2G2D4T                      3120
#define CLC2GLS1_D4T                  3121
#define CLC2GLS2                      3122
#define LC2G3D1N                      3123
#define CLC2GLS2_D1N                  3124
#define CLC2GLS2_D1T                  3125
#define LC2G3D1T                      3126
#define CLC2GLS2_D2N                  3127
#define LC2G3D2N                      3128
#define LC2G3D2T                      3129
#define CLC2GLS2_D2T                  3130
#define CLC2GLS2_D3N                  3131
#define LC2G3D3N                      3132
#define CLC2GLS2_D3T                  3133
#define LC2G3D3T                      3134
#define CLC2GLS2_D4N                  3135
#define LC2G3D4N                      3136
#define LC2G3D4T                      3137
#define CLC2GLS2_D4T                  3138
#define CLC2GLS3                      3139
#define LC2G4D1N                      3140
#define CLC2GLS3_G4D1N                3141
#define CLC2GLS3_G4D1T                3142
#define LC2G4D1T                      3143
#define CLC2GLS3_G4D2N                3144
#define LC2G4D2N                      3145
#define LC2G4D2T                      3146
#define CLC2GLS3_G4D2T                3147
#define CLC2GLS3_G4D3N                3148
#define LC2G4D3N                      3149
#define CLC2GLS3_G4D3T                3150
#define LC2G4D3T                      3151
#define LC2G4D4N                      3152
#define CLC2GLS3_G4D4N                3153
#define CLC2GLS3_G4D4T                3154
#define LC2G4D4T                      3155
#define CLC3CON                       3156
#define LC3MODE                       3157
#define CLC3CON_MODE0                 3158
#define LC3MODE0                      3159
#define CLC3CON_MODE                  3160
#define CLC3CON_MODE1                 3161
#define LC3MODE1                      3162
#define CLC3CON_MODE2                 3163
#define LC3MODE2                      3164
#define LC3INTN                       3165
#define CLC3CON_INTN                  3166
#define LC3INTP                       3167
#define CLC3CON_INTP                  3168
#define LC3OUT                        3169
#define CLC3CON_OUT                   3170
#define LC3EN                         3171
#define CLC3CON_EN                    3172
#define CLC3POL                       3173
#define LC3G1POL                      3174
#define CLC3POL_G1POL                 3175
#define LC3G2POL                      3176
#define CLC3POL_G2POL                 3177
#define CLC3POL_G3POL                 3178
#define LC3G3POL                      3179
#define LC3G4POL                      3180
#define CLC3POL_G4POL                 3181
#define LC3POL                        3182
#define CLC3POL_POL                   3183
#define CLC3SEL0                      3184
#define LC3D1S                        3185
#define CLC3SEL0_D1S                  3186
#define LC3D1S0                       3187
#define CLC3SEL0_D1S0                 3188
#define LC3D1S1                       3189
#define CLC3SEL0_D1S1                 3190
#define LC3D1S2                       3191
#define CLC3SEL0_D1S2                 3192
#define LC3D1S3                       3193
#define CLC3SEL0_D1S3                 3194
#define LC3D1S4                       3195
#define CLC3SEL0_D1S4                 3196
#define LC3D1S5                       3197
#define CLC3SEL0_D1S5                 3198
#define LC3D1S6                       3199
#define CLC3SEL0_D1S6                 3200
#define LC3D1S7                       3201
#define CLC3SEL0_D1S7                 3202
#define CLC3SEL1                      3203
#define LC3D2S0                       3204
#define LC3D2S                        3205
#define CLC3SEL1_D2S0                 3206
#define CLC3SEL1_D2S                  3207
#define LC3D2S1                       3208
#define CLC3SEL1_D2S1                 3209
#define LC3D2S2                       3210
#define CLC3SEL1_D2S2                 3211
#define LC3D2S3                       3212
#define CLC3SEL1_D2S3                 3213
#define LC3D2S4                       3214
#define CLC3SEL1_D2S4                 3215
#define LC3D2S5                       3216
#define CLC3SEL1_D2S5                 3217
#define LC3D2S6                       3218
#define CLC3SEL1_D2S6                 3219
#define LC3D2S7                       3220
#define CLC3SEL1_D2S7                 3221
#define CLC3SEL2                      3222
#define LC3D3S                        3223
#define CLC3SEL2_D3S                  3224
#define LC3D3S0                       3225
#define CLC3SEL2_D3S0                 3226
#define LC3D3S1                       3227
#define CLC3SEL2_D3S1                 3228
#define LC3D3S2                       3229
#define CLC3SEL2_D3S2                 3230
#define LC3D3S3                       3231
#define CLC3SEL2_D3S3                 3232
#define LC3D3S4                       3233
#define CLC3SEL2_D3S4                 3234
#define LC3D3S5                       3235
#define CLC3SEL2_D3S5                 3236
#define LC3D3S6                       3237
#define CLC3SEL2_D3S6                 3238
#define LC3D3S7                       3239
#define CLC3SEL2_D3S7                 3240
#define CLC3SEL3                      3241
#define CLC3SEL3_D4S                  3242
#define LC3D4S0                       3243
#define LC3D4S                        3244
#define CLC3SEL3_D4S0                 3245
#define LC3D4S1                       3246
#define CLC3SEL3_D4S1                 3247
#define LC3D4S2                       3248
#define CLC3SEL3_D4S2                 3249
#define LC3D4S3                       3250
#define CLC3SEL3_D4S3                 3251
#define LC3D4S4                       3252
#define CLC3SEL3_D4S4                 3253
#define LC3D4S5                       3254
#define CLC3SEL3_D4S5                 3255
#define LC3D4S6                       3256
#define CLC3SEL3_D4S6                 3257
#define LC3D4S7                       3258
#define CLC3SEL3_D4S7                 3259
#define CLC3GLS0                      3260
#define CLC3GLS0_D1N                  3261
#define LC3G1D1N                      3262
#define LC3G1D1T                      3263
#define CLC3GLS0_D1T                  3264
#define LC3G1D2N                      3265
#define CLC3GLS0_D2N                  3266
#define CLC3GLS0_D2T                  3267
#define LC3G1D2T                      3268
#define CLC3GLS0_D3N                  3269
#define LC3G1D3N                      3270
#define LC3G1D3T                      3271
#define CLC3GLS0_D3T                  3272
#define CLC3GLS0_D4N                  3273
#define LC3G1D4N                      3274
#define CLC3GLS0_D4T                  3275
#define LC3G1D4T                      3276
#define CLC3GLS1                      3277
#define LC3G2D1N                      3278
#define CLC3GLS1_D1N                  3279
#define CLC3GLS1_D1T                  3280
#define LC3G2D1T                      3281
#define LC3G2D2N                      3282
#define CLC3GLS1_D2N                  3283
#define LC3G2D2T                      3284
#define CLC3GLS1_D2T                  3285
#define LC3G2D3N                      3286
#define CLC3GLS1_D3N                  3287
#define CLC3GLS1_D3T                  3288
#define LC3G2D3T                      3289
#define LC3G2D4N                      3290
#define CLC3GLS1_D4N                  3291
#define LC3G2D4T                      3292
#define CLC3GLS1_D4T                  3293
#define CLC3GLS2                      3294
#define LC3G3D1N                      3295
#define CLC3GLS2_D1N                  3296
#define LC3G3D1T                      3297
#define CLC3GLS2_D1T                  3298
#define CLC3GLS2_D2N                  3299
#define LC3G3D2N                      3300
#define CLC3GLS2_D2T                  3301
#define LC3G3D2T                      3302
#define CLC3GLS2_D3N                  3303
#define LC3G3D3N                      3304
#define LC3G3D3T                      3305
#define CLC3GLS2_D3T                  3306
#define CLC3GLS2_D4N                  3307
#define LC3G3D4N                      3308
#define CLC3GLS2_D4T                  3309
#define LC3G3D4T                      3310
#define CLC3GLS3                      3311
#define LC3G4D1N                      3312
#define CLC3GLS3_G4D1N                3313
#define LC3G4D1T                      3314
#define CLC3GLS3_G4D1T                3315
#define LC3G4D2N                      3316
#define CLC3GLS3_G4D2N                3317
#define CLC3GLS3_G4D2T                3318
#define LC3G4D2T                      3319
#define LC3G4D3N                      3320
#define CLC3GLS3_G4D3N                3321
#define CLC3GLS3_G4D3T                3322
