tiborsimon/embedded-tdd-headers/pic/8bit/pic16f18877_tdd.h
#define LC3G4D3T                      3323
#define LC3G4D4N                      3324
#define CLC3GLS3_G4D4N                3325
#define LC3G4D4T                      3326
#define CLC3GLS3_G4D4T                3327
#define CLC4CON                       3328
#define LC4MODE                       3329
#define CLC4CON_MODE                  3330
#define LC4MODE0                      3331
#define CLC4CON_MODE0                 3332
#define LC4MODE1                      3333
#define CLC4CON_MODE1                 3334
#define LC4MODE2                      3335
#define CLC4CON_MODE2                 3336
#define LC4INTN                       3337
#define CLC4CON_INTN                  3338
#define CLC4CON_INTP                  3339
#define LC4INTP                       3340
#define CLC4CON_OUT                   3341
#define LC4OUT                        3342
#define CLC4CON_EN                    3343
#define LC4EN                         3344
#define CLC4POL                       3345
#define CLC4POL_G1POL                 3346
#define LC4G1POL                      3347
#define CLC4POL_G2POL                 3348
#define LC4G2POL                      3349
#define CLC4POL_G3POL                 3350
#define LC4G3POL                      3351
#define LC4G4POL                      3352
#define CLC4POL_G4POL                 3353
#define LC4POL                        3354
#define CLC4POL_POL                   3355
#define CLC4SEL0                      3356
#define LC4D1S0                       3357
#define CLC4SEL0_D1S                  3358
#define CLC4SEL0_D1S0                 3359
#define LC4D1S                        3360
#define LC4D1S1                       3361
#define CLC4SEL0_D1S1                 3362
#define LC4D1S2                       3363
#define CLC4SEL0_D1S2                 3364
#define LC4D1S3                       3365
#define CLC4SEL0_D1S3                 3366
#define LC4D1S4                       3367
#define CLC4SEL0_D1S4                 3368
#define LC4D1S5                       3369
#define CLC4SEL0_D1S5                 3370
#define LC4D1S6                       3371
#define CLC4SEL0_D1S6                 3372
#define LC4D1S7                       3373
#define CLC4SEL0_D1S7                 3374
#define CLC4SEL1                      3375
#define CLC4SEL1_D2S                  3376
#define CLC4SEL1_D2S0                 3377
#define LC4D2S                        3378
#define LC4D2S0                       3379
#define CLC4SEL1_D2S1                 3380
#define LC4D2S1                       3381
#define CLC4SEL1_D2S2                 3382
#define LC4D2S2                       3383
#define CLC4SEL1_D2S3                 3384
#define LC4D2S3                       3385
#define CLC4SEL1_D2S4                 3386
#define LC4D2S4                       3387
#define CLC4SEL1_D2S5                 3388
#define LC4D2S5                       3389
#define CLC4SEL1_D2S6                 3390
#define LC4D2S6                       3391
#define CLC4SEL1_D2S7                 3392
#define LC4D2S7                       3393
#define CLC4SEL2                      3394
#define CLC4SEL2_D3S                  3395
#define LC4D3S0                       3396
#define LC4D3S                        3397
#define CLC4SEL2_D3S0                 3398
#define LC4D3S1                       3399
#define CLC4SEL2_D3S1                 3400
#define LC4D3S2                       3401
#define CLC4SEL2_D3S2                 3402
#define LC4D3S3                       3403
#define CLC4SEL2_D3S3                 3404
#define LC4D3S4                       3405
#define CLC4SEL2_D3S4                 3406
#define LC4D3S5                       3407
#define CLC4SEL2_D3S5                 3408
#define LC4D3S6                       3409
#define CLC4SEL2_D3S6                 3410
#define LC4D3S7                       3411
#define CLC4SEL2_D3S7                 3412
#define CLC4SEL3                      3413
#define CLC4SEL3_D4S                  3414
#define LC4D4S0                       3415
#define CLC4SEL3_D4S0                 3416
#define LC4D4S                        3417
#define LC4D4S1                       3418
#define CLC4SEL3_D4S1                 3419
#define LC4D4S2                       3420
#define CLC4SEL3_D4S2                 3421
#define LC4D4S3                       3422
#define CLC4SEL3_D4S3                 3423
#define LC4D4S4                       3424
#define CLC4SEL3_D4S4                 3425
#define LC4D4S5                       3426
#define CLC4SEL3_D4S5                 3427
#define LC4D4S6                       3428
#define CLC4SEL3_D4S6                 3429
#define LC4D4S7                       3430
#define CLC4SEL3_D4S7                 3431
#define CLC4GLS0                      3432
#define CLC4GLS0_D1N                  3433
#define LC4G1D1N                      3434
#define CLC4GLS0_D1T                  3435
#define LC4G1D1T                      3436
#define CLC4GLS0_D2N                  3437
#define LC4G1D2N                      3438
#define CLC4GLS0_D2T                  3439
#define LC4G1D2T                      3440
#define CLC4GLS0_D3N                  3441
#define LC4G1D3N                      3442
#define CLC4GLS0_D3T                  3443
#define LC4G1D3T                      3444
#define CLC4GLS0_D4N                  3445
#define LC4G1D4N                      3446
#define CLC4GLS0_D4T                  3447
#define LC4G1D4T                      3448
#define CLC4GLS1                      3449
#define CLC4GLS1_D1N                  3450
#define LC4G2D1N                      3451
#define CLC4GLS1_D1T                  3452
#define LC4G2D1T                      3453
#define LC4G2D2N                      3454
#define CLC4GLS1_D2N                  3455
#define LC4G2D2T                      3456
#define CLC4GLS1_D2T                  3457
#define CLC4GLS1_D3N                  3458
#define LC4G2D3N                      3459
#define LC4G2D3T                      3460
#define CLC4GLS1_D3T                  3461
#define CLC4GLS1_D4N                  3462
#define LC4G2D4N                      3463
#define CLC4GLS1_D4T                  3464
#define LC4G2D4T                      3465
#define CLC4GLS2                      3466
#define CLC4GLS2_D1N                  3467
#define LC4G3D1N                      3468
#define CLC4GLS2_D1T                  3469
#define LC4G3D1T                      3470
#define LC4G3D2N                      3471
#define CLC4GLS2_D2N                  3472
#define LC4G3D2T                      3473
#define CLC4GLS2_D2T                  3474
#define CLC4GLS2_D3N                  3475
#define LC4G3D3N                      3476
#define CLC4GLS2_D3T                  3477
#define LC4G3D3T                      3478
#define LC4G3D4N                      3479
#define CLC4GLS2_D4N                  3480
#define LC4G3D4T                      3481
#define CLC4GLS2_D4T                  3482
#define CLC4GLS3                      3483
#define CLC4GLS3_G4D1N                3484
#define LC4G4D1N                      3485
#define LC4G4D1T                      3486
#define CLC4GLS3_G4D1T                3487
#define LC4G4D2N                      3488
#define CLC4GLS3_G4D2N                3489
#define LC4G4D2T                      3490
#define CLC4GLS3_G4D2T                3491
#define CLC4GLS3_G4D3N                3492
#define LC4G4D3N                      3493
#define CLC4GLS3_G4D3T                3494
#define LC4G4D3T                      3495
#define LC4G4D4N                      3496
#define CLC4GLS3_G4D4N                3497
#define LC4G4D4T                      3498
#define CLC4GLS3_G4D4T                3499
#define PPSLOCK                       3500
#define PPSLOCKED                     3501
#define INTPPS0                       3502
#define INTPPS                        3503
#define INTPPS1                       3504
#define INTPPS2                       3505
#define INTPPS3                       3506
#define T0CKIPPS                      3507
#define T0CKIPPS0                     3508
#define T0CKIPPS1                     3509
#define T0CKIPPS2                     3510
#define T0CKIPPS3                     3511
#define T1CKIPPS0                     3512
#define T1CKIPPS                      3513
#define T1CKIPPS1                     3514
#define T1CKIPPS2                     3515
#define T1CKIPPS3                     3516
#define T1CKIPPS4                     3517
#define T1GPPS0                       3518
#define T1GPPS                        3519
#define T1GPPS1                       3520
#define T1GPPS2                       3521
#define T1GPPS3                       3522
#define T1GPPS4                       3523
#define T3CKIPPS0                     3524
#define T3CKIPPS                      3525
#define T3CKIPPS1                     3526
#define T3CKIPPS2                     3527
#define T3CKIPPS3                     3528
#define T3CKIPPS4                     3529
#define T3GPPS0                       3530
#define T3GPPS                        3531
#define T3GPPS1                       3532
#define T3GPPS2                       3533
#define T3GPPS3                       3534
#define T3GPPS4                       3535
#define T5CKIPPS0                     3536
#define T5CKIPPS                      3537
#define T5CKIPPS1                     3538
#define T5CKIPPS2                     3539
#define T5CKIPPS3                     3540
#define T5CKIPPS4                     3541
#define T5GPPS                        3542
#define T5GPPS0                       3543
#define T5GPPS1                       3544
#define T5GPPS2                       3545
#define T5GPPS3                       3546
#define T5GPPS4                       3547
#define T2AINPPS                      3548
#define T2AINPPS0                     3549
#define T2AINPPS1                     3550
#define T2AINPPS2                     3551
#define T2AINPPS3                     3552
#define T2AINPPS4                     3553
#define T4AINPPS                      3554
#define T4AINPPS0                     3555
#define T4AINPPS1                     3556
#define T4AINPPS2                     3557
#define T4AINPPS3                     3558
#define T4AINPPS4                     3559
#define T6AINPPS0                     3560
#define T6AINPPS                      3561
#define T6AINPPS1                     3562
#define T6AINPPS2                     3563
#define T6AINPPS3                     3564
#define T6AINPPS4                     3565
#define CCP1PPS0                      3566
#define CCP1PPS                       3567
#define CCP1PPS1                      3568
#define CCP1PPS2                      3569
#define CCP1PPS3                      3570
#define CCP1PPS4                      3571
#define CCP2PPS0                      3572
#define CCP2PPS                       3573
#define CCP2PPS1                      3574
#define CCP2PPS2                      3575
#define CCP2PPS3                      3576
#define CCP2PPS4                      3577
#define CCP3PPS0                      3578
#define CCP3PPS                       3579
#define CCP3PPS1                      3580
#define CCP3PPS2                      3581
#define CCP3PPS3                      3582
#define CCP3PPS4                      3583
#define CCP4PPS0                      3584
#define CCP4PPS                       3585
#define CCP4PPS1                      3586
#define CCP4PPS2                      3587
#define CCP4PPS3                      3588
#define CCP4PPS4                      3589
#define CCP5PPS                       3590
#define CCP5PPS0                      3591
#define CCP5PPS1                      3592
#define CCP5PPS2                      3593
#define CCP5PPS3                      3594
#define CCP5PPS4                      3595
#define CCP6PPS                       3596
#define SMT1WINPPS                    3597
#define SMU1WINPPS0                   3598
#define SMU1WINPPS1                   3599
#define SMU1WINPPS2                   3600
#define SMU1WINPPS3                   3601
#define SMU1WINPPS4                   3602
#define SMT1SIGPPS                    3603
#define SMU1SIGPPS0                   3604
#define SMU1SIGPPS1                   3605
#define SMU1SIGPPS2                   3606
#define SMU1SIGPPS3                   3607
#define SMU1SIGPPS4                   3608
#define SMT2WINPPS                    3609
#define SMU2WINPPS0                   3610
#define SMU2WINPPS1                   3611
#define SMU2WINPPS2                   3612
#define SMU2WINPPS3                   3613
#define SMU2WINPPS4                   3614
#define SMT2SIGPPS                    3615
#define SMU2SIGPPS0                   3616
#define SMU2SIGPPS1                   3617
#define SMU2SIGPPS2                   3618
#define SMU2SIGPPS3                   3619
#define SMU2SIGPPS4                   3620
#define CWG1PPS0                      3621
#define CWG1PPS                       3622
#define CWG1PPS1                      3623
#define CWG1PPS2                      3624
#define CWG1PPS3                      3625
#define CWG1PPS4                      3626
#define CWG2PPS0                      3627
#define CWG2PPS                       3628
#define CWG2PPS1                      3629
#define CWG2PPS2                      3630
#define CWG2PPS3                      3631
#define CWG2PPS4                      3632
#define CWG3PPS0                      3633
#define CWG3PPS                       3634
#define CWG3PPS1                      3635
#define CWG3PPS2                      3636
#define CWG3PPS3                      3637
#define CWG3PPS4                      3638
#define MDCARLPPS                     3639
#define MDCARLPPS0                    3640
#define MDCARLPPS1                    3641
#define MDCARLPPS2                    3642
#define MDCARLPPS3                    3643
#define MDCARLPPS4                    3644
#define MDCARHPPS0                    3645
#define MDCARHPPS                     3646
#define MDCARHPPS1                    3647
#define MDCARHPPS2                    3648
#define MDCARHPPS3                    3649
#define MDCARHPPS4                    3650
#define MDSRCPPS0                     3651
#define MDSRCPPS                      3652
#define MDSRCPPS1                     3653
#define MDSRCPPS2                     3654
#define MDSRCPPS3                     3655
#define MDSRCPPS4                     3656
#define CLCIN0PPS                     3657
#define CLCIN0PPS0                    3658
#define CLCIN0PPS1                    3659
#define CLCIN0PPS2                    3660
#define CLCIN0PPS3                    3661
#define CLCIN0PPS4                    3662
#define CLCIN1PPS                     3663
#define CLCIN1PPS0                    3664
#define CLCIN1PPS1                    3665
#define CLCIN1PPS2                    3666
#define CLCIN1PPS3                    3667
#define CLCIN1PPS4                    3668
#define CLCIN2PPS                     3669
#define CLCIN2PPS0                    3670
#define CLCIN2PPS1                    3671
#define CLCIN2PPS2                    3672
#define CLCIN2PPS3                    3673
#define CLCIN2PPS4                    3674
#define CLCIN3PPS                     3675
#define CLCIN3PPS0                    3676
#define CLCIN3PPS1                    3677
#define CLCIN3PPS2                    3678
#define CLCIN3PPS3                    3679
#define CLCIN3PPS4                    3680
#define ADCACTPPS                     3681
#define ADCACTPPS0                    3682
#define ADCACTPPS1                    3683
#define ADCACTPPS2                    3684
#define ADCACTPPS3                    3685
#define ADCACTPPS4                    3686
#define SSP1CLKPPS                    3687
#define SSP1CLKPPS0                   3688
#define SSP1CLKPPS1                   3689
#define SSP1CLKPPS2                   3690
#define SSP1CLKPPS3                   3691
#define SSP1CLKPPS4                   3692
#define SSP1DATPPS                    3693
#define SSP1DATPPS0                   3694
#define SSP1DATPPS1                   3695
#define SSP1DATPPS2                   3696
#define SSP1DATPPS3                   3697
#define SSP1DATPPS4                   3698
#define SSP1SSPPS                     3699
#define SSP1SSPPS0                    3700
#define SSP1SSPPS1                    3701
#define SSP1SSPPS2                    3702
#define SSP1SSPPS3                    3703
#define SSP1SSPPS4                    3704
#define SSP2CLKPPS                    3705
#define SSP2CLKPPS0                   3706
#define SSP2CLKPPS1                   3707
#define SSP2CLKPPS2                   3708
#define SSP2CLKPPS3                   3709
#define SSP2CLKPPS4                   3710
#define SSP2DATPPS                    3711
#define SSP2DATPPS0                   3712
#define SSP2DATPPS1                   3713
#define SSP2DATPPS2                   3714
#define SSP2DATPPS3                   3715
#define SSP2DATPPS4                   3716
#define SSP2SSPPS                     3717
#define SSP2SSPPS0                    3718
#define SSP2SSPPS1                    3719
#define SSP2SSPPS2                    3720
#define SSP2SSPPS3                    3721
#define SSP2SSPPS4                    3722
#define RXPPS                         3723
#define RXPPS0                        3724
#define RXPPS1                        3725
#define RXPPS2                        3726
#define RXPPS3                        3727
#define RXPPS4                        3728
#define TXPPS                         3729
#define TXPPS0                        3730
#define TXPPS1                        3731
#define TXPPS2                        3732
#define TXPPS3                        3733
#define TXPPS4                        3734
#define RA0PPS                        3735
#define RA0PPS0                       3736
#define RA0PPS1                       3737
#define RA0PPS2                       3738
#define RA0PPS3                       3739
#define RA0PPS4                       3740
#define RA0PPS5                       3741
#define RA1PPS                        3742
#define RA1PPS0                       3743
#define RA1PPS1                       3744
#define RA1PPS2                       3745
#define RA1PPS3                       3746
#define RA1PPS4                       3747
#define RA1PPS5                       3748
#define RA2PPS                        3749
#define RA2PPS0                       3750
#define RA2PPS1                       3751
#define RA2PPS2                       3752
#define RA2PPS3                       3753
#define RA2PPS4                       3754
#define RA2PPS5                       3755
#define RA3PPS                        3756
#define RA3PPS0                       3757
#define RA3PPS1                       3758
#define RA3PPS2                       3759
#define RA3PPS3                       3760
#define RA3PPS4                       3761
#define RA3PPS5                       3762
#define RA4PPS                        3763
#define RA4PPS0                       3764
#define RA4PPS1                       3765
#define RA4PPS2                       3766
#define RA4PPS3                       3767
#define RA4PPS4                       3768
#define RA4PPS5                       3769
#define RA5PPS                        3770
#define RA5PPS0                       3771
#define RA5PPS1                       3772
#define RA5PPS2                       3773
#define RA5PPS3                       3774
#define RA5PPS4                       3775
#define RA5PPS5                       3776
#define RA6PPS                        3777
#define RA6PPS0                       3778
#define RA6PPS1                       3779
#define RA6PPS2                       3780
#define RA6PPS3                       3781
#define RA6PPS4                       3782
#define RA6PPS5                       3783
#define RA7PPS                        3784
#define RA7PPS0                       3785
#define RA7PPS1                       3786
#define RA7PPS2                       3787
#define RA7PPS3                       3788
#define RA7PPS4                       3789
#define RA7PPS5                       3790
#define RB0PPS                        3791
#define RB0PPS0                       3792
#define RB0PPS1                       3793
#define RB0PPS2                       3794
#define RB0PPS3                       3795
#define RB0PPS4                       3796
#define RB0PPS5                       3797
#define RB1PPS                        3798
#define RB1PPS0                       3799
#define RB1PPS1                       3800
#define RB1PPS2                       3801
#define RB1PPS3                       3802
#define RB1PPS4                       3803
#define RB1PPS5                       3804
#define RB2PPS                        3805
#define RB2PPS0                       3806
#define RB2PPS1                       3807
#define RB2PPS2                       3808
#define RB2PPS3                       3809
#define RB2PPS4                       3810
#define RB2PPS5                       3811
#define RB3PPS                        3812
#define RB3PPS0                       3813
#define RB3PPS1                       3814
#define RB3PPS2                       3815
#define RB3PPS3                       3816
#define RB3PPS4                       3817
#define RB3PPS5                       3818
#define RB4PPS                        3819
#define RB4PPS0                       3820
#define RB4PPS1                       3821
#define RB4PPS2                       3822
#define RB4PPS3                       3823
#define RB4PPS4                       3824
#define RB4PPS5                       3825
#define RB5PPS                        3826
#define RB5PPS0                       3827
#define RB5PPS1                       3828
#define RB5PPS2                       3829
#define RB5PPS3                       3830
#define RB5PPS4                       3831
#define RB5PPS5                       3832
#define RB6PPS                        3833
#define RB6PPS0                       3834
#define RB6PPS1                       3835
#define RB6PPS2                       3836
#define RB6PPS3                       3837
#define RB6PPS4                       3838
#define RB6PPS5                       3839
#define RB7PPS                        3840
#define RB7PPS0                       3841
#define RB7PPS1                       3842
#define RB7PPS2                       3843
#define RB7PPS3                       3844
#define RB7PPS4                       3845
#define RB7PPS5                       3846
#define RC0PPS                        3847
#define RC0PPS0                       3848
#define RC0PPS1                       3849
#define RC0PPS2                       3850
#define RC0PPS3                       3851
#define RC0PPS4                       3852
#define RC0PPS5                       3853
#define RC1PPS                        3854
#define RC1PPS0                       3855
#define RC1PPS1                       3856
#define RC1PPS2                       3857
#define RC1PPS3                       3858
#define RC1PPS4                       3859
#define RC1PPS5                       3860
#define RC2PPS                        3861
#define RC2PPS0                       3862
#define RC2PPS1                       3863
#define RC2PPS2                       3864
#define RC2PPS3                       3865
#define RC2PPS4                       3866
#define RC2PPS5                       3867
#define RC3PPS                        3868
#define RC3PPS0                       3869
#define RC3PPS1                       3870
#define RC3PPS2                       3871
#define RC3PPS3                       3872
#define RC3PPS4                       3873
#define RC3PPS5                       3874
#define RC4PPS                        3875
#define RC4PPS0                       3876
#define RC4PPS1                       3877
#define RC4PPS2                       3878
#define RC4PPS3                       3879
#define RC4PPS4                       3880
