tiborsimon/embedded-tdd-headers/pic/8bit/pic16f18877_tdd.h
#define RC4PPS5                       3881
#define RC5PPS                        3882
#define RC5PPS0                       3883
#define RC5PPS1                       3884
#define RC5PPS2                       3885
#define RC5PPS3                       3886
#define RC5PPS4                       3887
#define RC5PPS5                       3888
#define RC6PPS                        3889
#define RC6PPS0                       3890
#define RC6PPS1                       3891
#define RC6PPS2                       3892
#define RC6PPS3                       3893
#define RC6PPS4                       3894
#define RC6PPS5                       3895
#define RC7PPS                        3896
#define RC7PPS0                       3897
#define RC7PPS1                       3898
#define RC7PPS2                       3899
#define RC7PPS3                       3900
#define RC7PPS4                       3901
#define RC7PPS5                       3902
#define RD0PPS                        3903
#define RD0PPS0                       3904
#define RD0PPS1                       3905
#define RD0PPS2                       3906
#define RD0PPS3                       3907
#define RD0PPS4                       3908
#define RD0PPS5                       3909
#define RD1PPS                        3910
#define RD1PPS0                       3911
#define RD1PPS1                       3912
#define RD1PPS2                       3913
#define RD1PPS3                       3914
#define RD1PPS4                       3915
#define RD1PPS5                       3916
#define RD2PPS                        3917
#define RD2PPS0                       3918
#define RD2PPS1                       3919
#define RD2PPS2                       3920
#define RD2PPS3                       3921
#define RD2PPS4                       3922
#define RD2PPS5                       3923
#define RD3PPS                        3924
#define RD3PPS0                       3925
#define RD3PPS1                       3926
#define RD3PPS2                       3927
#define RD3PPS3                       3928
#define RD3PPS4                       3929
#define RD3PPS5                       3930
#define RD4PPS                        3931
#define RD4PPS0                       3932
#define RD4PPS1                       3933
#define RD4PPS2                       3934
#define RD4PPS3                       3935
#define RD4PPS4                       3936
#define RD4PPS5                       3937
#define RD5PPS                        3938
#define RD5PPS0                       3939
#define RD5PPS1                       3940
#define RD5PPS2                       3941
#define RD5PPS3                       3942
#define RD5PPS4                       3943
#define RD5PPS5                       3944
#define RD6PPS                        3945
#define RD6PPS0                       3946
#define RD6PPS1                       3947
#define RD6PPS2                       3948
#define RD6PPS3                       3949
#define RD6PPS4                       3950
#define RD6PPS5                       3951
#define RD7PPS                        3952
#define RD7PPS0                       3953
#define RD7PPS1                       3954
#define RD7PPS2                       3955
#define RD7PPS3                       3956
#define RD7PPS4                       3957
#define RD7PPS5                       3958
#define RE0PPS                        3959
#define RE0PPS0                       3960
#define RE0PPS1                       3961
#define RE0PPS2                       3962
#define RE0PPS3                       3963
#define RE0PPS4                       3964
#define RE0PPS5                       3965
#define RE1PPS                        3966
#define RE1PPS0                       3967
#define RE1PPS1                       3968
#define RE1PPS2                       3969
#define RE1PPS3                       3970
#define RE1PPS4                       3971
#define RE1PPS5                       3972
#define RE2PPS                        3973
#define RE2PPS0                       3974
#define RE2PPS1                       3975
#define RE2PPS2                       3976
#define RE2PPS3                       3977
#define RE2PPS4                       3978
#define RE2PPS5                       3979
#define ANSELA                        3980
#define ANSA0                         3981
#define ANSA1                         3982
#define ANSA2                         3983
#define ANSA3                         3984
#define ANSA4                         3985
#define ANSA5                         3986
#define ANSA6                         3987
#define ANSA7                         3988
#define WPUA                          3989
#define WPUA0                         3990
#define WPUA1                         3991
#define WPUA2                         3992
#define WPUA3                         3993
#define WPUA4                         3994
#define WPUA5                         3995
#define WPUA6                         3996
#define WPUA7                         3997
#define ODCONA                        3998
#define ODCA0                         3999
#define ODCA1                         4000
#define ODCA2                         4001
#define ODCA3                         4002
#define ODCA4                         4003
#define ODCA5                         4004
#define ODCA6                         4005
#define ODCA7                         4006
#define SLRCONA                       4007
#define SLRA0                         4008
#define SLRA1                         4009
#define SLRA2                         4010
#define SLRA3                         4011
#define SLRA4                         4012
#define SLRA5                         4013
#define SLRA6                         4014
#define SLRA7                         4015
#define INLVLA                        4016
#define INLVLA0                       4017
#define INLVLA1                       4018
#define INLVLA2                       4019
#define INLVLA3                       4020
#define INLVLA4                       4021
#define INLVLA5                       4022
#define INLVLA6                       4023
#define INLVLA7                       4024
#define IOCAP                         4025
#define IOCAP0                        4026
#define IOCAP1                        4027
#define IOCAP2                        4028
#define IOCAP3                        4029
#define IOCAP4                        4030
#define IOCAP5                        4031
#define IOCAP6                        4032
#define IOCAP7                        4033
#define IOCAN                         4034
#define IOCAN0                        4035
#define IOCAN1                        4036
#define IOCAN2                        4037
#define IOCAN3                        4038
#define IOCAN4                        4039
#define IOCAN5                        4040
#define IOCAN6                        4041
#define IOCAN7                        4042
#define IOCAF                         4043
#define IOCAF0                        4044
#define IOCAF1                        4045
#define IOCAF2                        4046
#define IOCAF3                        4047
#define IOCAF4                        4048
#define IOCAF5                        4049
#define IOCAF6                        4050
#define IOCAF7                        4051
#define CCDNA                         4052
#define CCDNA0                        4053
#define CCDNA1                        4054
#define CCDNA2                        4055
#define CCDNA3                        4056
#define CCDNA4                        4057
#define CCDNA5                        4058
#define CCDNA6                        4059
#define CCDNA7                        4060
#define CCDPA                         4061
#define CCDPA0                        4062
#define CCDPA1                        4063
#define CCDPA2                        4064
#define CCDPA3                        4065
#define CCDPA4                        4066
#define CCDPA5                        4067
#define CCDPA6                        4068
#define CCDPA7                        4069
#define ANSELB                        4070
#define ANSB0                         4071
#define ANSB1                         4072
#define ANSB2                         4073
#define ANSB3                         4074
#define ANSB4                         4075
#define ANSB5                         4076
#define ANSB6                         4077
#define ANSB7                         4078
#define WPUB                          4079
#define WPUB0                         4080
#define WPUB1                         4081
#define WPUB2                         4082
#define WPUB3                         4083
#define WPUB4                         4084
#define WPUB5                         4085
#define WPUB6                         4086
#define WPUB7                         4087
#define ODCONB                        4088
#define ODCB0                         4089
#define ODCB1                         4090
#define ODCB2                         4091
#define ODCB3                         4092
#define ODCB4                         4093
#define ODCB5                         4094
#define ODCB6                         4095
#define ODCB7                         4096
#define SLRCONB                       4097
#define SLRB0                         4098
#define SLRB1                         4099
#define SLRB2                         4100
#define SLRB3                         4101
#define SLRB4                         4102
#define SLRB5                         4103
#define SLRB6                         4104
#define SLRB7                         4105
#define INLVLB                        4106
#define INLVLB0                       4107
#define INLVLB1                       4108
#define INLVLB2                       4109
#define INLVLB3                       4110
#define INLVLB4                       4111
#define INLVLB5                       4112
#define INLVLB6                       4113
#define INLVLB7                       4114
#define IOCBP                         4115
#define IOCBP0                        4116
#define IOCBP1                        4117
#define IOCBP2                        4118
#define IOCBP3                        4119
#define IOCBP4                        4120
#define IOCBP5                        4121
#define IOCBP6                        4122
#define IOCBP7                        4123
#define IOCBN                         4124
#define IOCBN0                        4125
#define IOCBN1                        4126
#define IOCBN2                        4127
#define IOCBN3                        4128
#define IOCBN4                        4129
#define IOCBN5                        4130
#define IOCBN6                        4131
#define IOCBN7                        4132
#define IOCBF                         4133
#define IOCBF0                        4134
#define IOCBF1                        4135
#define IOCBF2                        4136
#define IOCBF3                        4137
#define IOCBF4                        4138
#define IOCBF5                        4139
#define IOCBF6                        4140
#define IOCBF7                        4141
#define CCDNB                         4142
#define CCDNB0                        4143
#define CCDNB1                        4144
#define CCDNB2                        4145
#define CCDNB3                        4146
#define CCDNB4                        4147
#define CCDNB5                        4148
#define CCDNB6                        4149
#define CCDNB7                        4150
#define CCDPB                         4151
#define CCDPB0                        4152
#define CCDPB1                        4153
#define CCDPB2                        4154
#define CCDPB3                        4155
#define CCDPB4                        4156
#define CCDPB5                        4157
#define CCDPB6                        4158
#define CCDPB7                        4159
#define ANSELC                        4160
#define ANSC0                         4161
#define ANSC1                         4162
#define ANSC2                         4163
#define ANSC3                         4164
#define ANSC4                         4165
#define ANSC5                         4166
#define ANSC6                         4167
#define ANSC7                         4168
#define WPUC                          4169
#define WPUC0                         4170
#define WPUC1                         4171
#define WPUC2                         4172
#define WPUC3                         4173
#define WPUC4                         4174
#define WPUC5                         4175
#define WPUC6                         4176
#define WPUC7                         4177
#define ODCONC                        4178
#define ODCC0                         4179
#define ODCC1                         4180
#define ODCC2                         4181
#define ODCC3                         4182
#define ODCC4                         4183
#define ODCC5                         4184
#define ODCC6                         4185
#define ODCC7                         4186
#define SLRCONC                       4187
#define SLRC0                         4188
#define SLRC1                         4189
#define SLRC2                         4190
#define SLRC3                         4191
#define SLRC4                         4192
#define SLRC5                         4193
#define SLRC6                         4194
#define SLRC7                         4195
#define INLVLC                        4196
#define INLVLC0                       4197
#define INLVLC1                       4198
#define INLVLC2                       4199
#define INLVLC3                       4200
#define INLVLC4                       4201
#define INLVLC5                       4202
#define INLVLC6                       4203
#define INLVLC7                       4204
#define IOCCP                         4205
#define IOCCP0                        4206
#define IOCCP1                        4207
#define IOCCP2                        4208
#define IOCCP3                        4209
#define IOCCP4                        4210
#define IOCCP5                        4211
#define IOCCP6                        4212
#define IOCCP7                        4213
#define IOCCN                         4214
#define IOCCN0                        4215
#define IOCCN1                        4216
#define IOCCN2                        4217
#define IOCCN3                        4218
#define IOCCN4                        4219
#define IOCCN5                        4220
#define IOCCN6                        4221
#define IOCCN7                        4222
#define IOCCF                         4223
#define IOCCF0                        4224
#define IOCCF1                        4225
#define IOCCF2                        4226
#define IOCCF3                        4227
#define IOCCF4                        4228
#define IOCCF5                        4229
#define IOCCF6                        4230
#define IOCCF7                        4231
#define CCDNC                         4232
#define CCDNC0                        4233
#define CCDNC1                        4234
#define CCDNC2                        4235
#define CCDNC3                        4236
#define CCDNC4                        4237
#define CCDNC5                        4238
#define CCDNC6                        4239
#define CCDNC7                        4240
#define CCDPC                         4241
#define CCDPC0                        4242
#define CCDPC1                        4243
#define CCDPC2                        4244
#define CCDPC3                        4245
#define CCDPC4                        4246
#define CCDPC5                        4247
#define CCDPC6                        4248
#define CCDPC7                        4249
#define ANSELD                        4250
#define ANSD0                         4251
#define ANSD1                         4252
#define ANSD2                         4253
#define ANSD3                         4254
#define ANSD4                         4255
#define ANSD5                         4256
#define ANSD6                         4257
#define ANSD7                         4258
#define WPUD                          4259
#define WPUD0                         4260
#define WPUD1                         4261
#define WPUD2                         4262
#define WPUD3                         4263
#define WPUD4                         4264
#define WPUD5                         4265
#define WPUD6                         4266
#define WPUD7                         4267
#define ODCOND                        4268
#define ODCD0                         4269
#define ODCD1                         4270
#define ODCD2                         4271
#define ODCD3                         4272
#define ODCD4                         4273
#define ODCD5                         4274
#define ODCD6                         4275
#define ODCD7                         4276
#define SLRCOND                       4277
#define SLRD0                         4278
#define SLRD1                         4279
#define SLRD2                         4280
#define SLRD3                         4281
#define SLRD4                         4282
#define SLRD5                         4283
#define SLRD6                         4284
#define SLRD7                         4285
#define INLVLD                        4286
#define INLVLD0                       4287
#define INLVLD1                       4288
#define INLVLD2                       4289
#define INLVLD3                       4290
#define INLVLD4                       4291
#define INLVLD5                       4292
#define INLVLD6                       4293
#define INLVLD7                       4294
#define CCDND                         4295
#define CCDND0                        4296
#define CCDND1                        4297
#define CCDND2                        4298
#define CCDND3                        4299
#define CCDND4                        4300
#define CCDND5                        4301
#define CCDND6                        4302
#define CCDND7                        4303
#define CCDPD                         4304
#define CCDPD0                        4305
#define CCDPD1                        4306
#define CCDPD2                        4307
#define CCDPD3                        4308
#define CCDPD4                        4309
#define CCDPD5                        4310
#define CCDPD6                        4311
#define CCDPD7                        4312
#define ANSELE                        4313
#define ANSE0                         4314
#define ANSE1                         4315
#define ANSE2                         4316
#define WPUE                          4317
#define WPUE0                         4318
#define WPUE1                         4319
#define WPUE2                         4320
#define WPUE3                         4321
#define ODCONE                        4322
#define ODCE0                         4323
#define ODCE1                         4324
#define ODCE2                         4325
#define SLRCONE                       4326
#define SLRE0                         4327
#define SLRE1                         4328
#define SLRE2                         4329
#define INLVLE                        4330
#define INLVLE0                       4331
#define INLVLE1                       4332
#define INLVLE2                       4333
#define INLVLE3                       4334
#define IOCEP                         4335
#define IOCEP3                        4336
#define IOCEN                         4337
#define IOCEN3                        4338
#define IOCEF                         4339
#define IOCEF3                        4340
#define CCDNE                         4341
#define CCDNE0                        4342
#define CCDNE1                        4343
#define CCDNE2                        4344
#define CCDPE                         4345
#define CCDPE0                        4346
#define CCDPE1                        4347
#define CCDPE2                        4348
#define STATUS_SHAD                   4349
#define C_SHAD                        4350
#define DC_SHAD                       4351
#define Z_SHAD                        4352
#define WREG_SHAD                     4353
#define BSR_SHAD                      4354
#define PCLATH_SHAD                   4355
#define FSR0L_SHAD                    4356
#define FSR0H_SHAD                    4357
#define FSR1L_SHAD                    4358
#define FSR1H_SHAD                    4359
#define STKPTR                        4360
#define TOSL                          4361
#define TOSH                          4362

#endif // _PIC16F18877_H_
